SKILLS: dict[int, dict[int, dict]] = {
    10533: {
        19712: dict(channel_interval=24)
    },
    19737: {
        19766: dict(comment="1段"),
        19767: dict(comment="2段"),
        20014: dict(comment="3段")
    },
    19818: {
        19819: {},
        32815: dict(levels=[6])
    },
    20245: {
        20250: {}
    },
    19827: {
        20016: {}
    },
    20259: {
        31250: {}
    },
    20053: {
        20054: {},
        32815: dict(levels=[5])
    },
    19828: {
        20052: {}
    },
    20715: {
        20684: dict(comment="<8尺"),
        20685: dict(comment="<4尺")
    },
    20083: {
        20322: {}
    },
    20084: {
        20323: {}
    }
}
