SKILLS: dict[int, dict[int, dict]] = {
    10026: {
        12: dict(channel_interval=27)
    },
    400: {
        18207: dict(comment="1段"),
        18208: dict(comment="2段")
    },
    403: {
        18603: {}
    },
    415: {
        18773: {},
        32820: dict(levels=[1])
    },
    480: {
        21251: {}
    },
    418: {
        431: {},
        14882: dict(comment="{level*8}尺")
    },
    424: {
        432: {}
    },
    423: {
        701: dict(comment="自身<50%血量"),
        702: dict(comment="自身>50%血量")
    },
    427: {
        14887: {}
    },
    428: {
        409: {}
    },
    2603: {
        13778: {}
    },
    44368: {
        44364: {},
        24009: {}
    }
}
