RECIPES = {
    10003: {
        233: {
            1: {
                "recipe_name": "《龙爪功·捕风式》参悟残页"
            }
        },
        234: {
            1: {
                "recipe_name": "《龙爪功·捕风式》参悟断篇"
            }
        },
        235: {
            1: {
                "recipe_name": "《龙爪功·捕风式》参悟绝章"
            }
        },
        259: {
            1: {
                "recipe_name": "《罗汉棍法·横扫六合》参悟残页"
            }
        },
        268: {
            1: {
                "recipe_name": "《罗汉棍法·普渡四方》参悟残页"
            }
        },
        269: {
            1: {
                "recipe_name": "《罗汉棍法·普渡四方》参悟断篇"
            }
        },
        270: {
            1: {
                "recipe_name": "《罗汉棍法·普渡四方》参悟绝章"
            }
        },
        281: {
            1: {
                "recipe_name": "《龙爪功·守缺式》秘诀绝章"
            }
        },
        285: {
            1: {
                "recipe_name": "《龙爪功·守缺式》秘诀残页"
            }
        },
        286: {
            1: {
                "recipe_name": "《龙爪功·守缺式》秘诀断篇"
            }
        },
        287: {
            1: {
                "recipe_name": "《龙爪功·守缺式》参悟残页"
            }
        },
        288: {
            1: {
                "recipe_name": "《龙爪功·守缺式》参悟断篇"
            }
        },
        289: {
            1: {
                "recipe_name": "《龙爪功·守缺式》参悟绝章"
            }
        },
        290: {
            1: {
                "recipe_name": "《罗汉棍法·韦陀献杵》秘诀残页"
            }
        },
        291: {
            1: {
                "recipe_name": "《罗汉棍法·韦陀献杵》秘诀断篇"
            }
        },
        292: {
            1: {
                "recipe_name": "《罗汉棍法·韦陀献杵》秘诀绝章"
            }
        },
        295: {
            1: {
                "recipe_name": "《罗汉棍法·韦陀献杵》参悟残页"
            }
        },
        296: {
            1: {
                "recipe_name": "《罗汉棍法·韦陀献杵》参悟断篇"
            }
        },
        297: {
            1: {
                "recipe_name": "《罗汉棍法·韦陀献杵》参悟绝章"
            }
        },
        1645: {
            1: {
                "recipe_name": "《龙爪功·拿云式》参悟残页"
            }
        },
        1646: {
            1: {
                "recipe_name": "《龙爪功·拿云式》参悟断篇"
            }
        },
        1647: {
            1: {
                "recipe_name": "《龙爪功·拿云式》参悟绝章"
            }
        },
        959: {
            1: {
                "recipe_name": "普度加伤害3%"
            },
            2: {
                "recipe_name": "普度加伤害6%"
            },
            3: {
                "recipe_name": "普度加伤害9%"
            }
        },
        818: {
            1: {
                "recipe_name": "PVE6件套_剑纯"
            },
            2: {
                "recipe_name": "PVE6件套_气纯"
            },
            3: {
                "recipe_name": "PVE6件套_冰心"
            },
            5: {
                "recipe_name": "PVE6件套_易经"
            },
            6: {
                "recipe_name": "PVE6件套_藏剑"
            },
            7: {
                "recipe_name": "PVE6件套_毒经"
            }
        },
        1147: {
            1: {
                "recipe_name": "PVE6件套_易经_拿云伤害"
            }
        },
        1512: {
            1: {
                "recipe_name": "90级易筋橙武属性1"
            }
        },
        1513: {
            1: {
                "recipe_name": "90级易筋橙武属性2"
            }
        },
        1139: {
            1: {
                "recipe_name": "小橙武_易经"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        2862: {
            1: {
                "recipe_name": "大cw韦陀加成"
            }
        },
        5779: {
            1: {
                "recipe_name": "众嗔韦陀"
            }
        },
        5780: {
            1: {
                "recipe_name": "众嗔拿云"
            }
        },
        5653: {
            1: {
                "recipe_name": "袈裟普渡"
            }
        },
        5654: {
            1: {
                "recipe_name": "袈裟韦陀"
            }
        },
        5655: {
            1: {
                "recipe_name": "袈裟横扫六合"
            }
        },
        5656: {
            1: {
                "recipe_name": "袈裟摩诃无量"
            }
        },
        5790: {
            1: {
                "recipe_name": "袈裟醍醐灌顶"
            }
        },
        4874: {
            1: {
                "recipe_name": "拿云加距离"
            }
        },
        3038: {
            1: {
                "recipe_name": "种豆得豆袈裟加CD"
            }
        },
        3039: {
            1: {
                "recipe_name": "种豆得豆伏魔加CD"
            }
        },
        2616: {
            1: {
                "recipe_name": "无执横扫六合"
            }
        },
        5113: {
            1: {
                "recipe_name": "千斤坠充能"
            }
        },
        5539: {
            1: {
                "recipe_name": "静色充能"
            }
        },
        4280: {
            1: {
                "recipe_name": "擒龙变充能"
            }
        },
        2299: {
            1: {
                "recipe_name": "守缺10%会心会效"
            }
        },
        4047: {
            1: {
                "recipe_name": "韦陀降魔25%"
            },
            2: {
                "recipe_name": "韦陀降魔50%"
            }
        },
        4048: {
            1: {
                "recipe_name": "拿云降魔25%"
            },
            2: {
                "recipe_name": "拿云降魔50%"
            }
        },
        5157: {
            1: {
                "recipe_name": "横扫加会心减cd"
            }
        },
        1258: {
            1: {
                "recipe_name": "摩诃无量加4尺减6秒CD"
            }
        }
    },
    10014: {
        19: {
            1: {
                "recipe_name": "《北冥剑气·两仪化形》秘诀残页"
            }
        },
        20: {
            1: {
                "recipe_name": "《北冥剑气·两仪化形》秘诀断篇"
            }
        },
        21: {
            1: {
                "recipe_name": "《北冥剑气·两仪化形》秘诀绝章"
            }
        },
        24: {
            1: {
                "recipe_name": "《北冥剑气·两仪化形》参悟残页"
            }
        },
        25: {
            1: {
                "recipe_name": "《北冥剑气·两仪化形》参悟断篇"
            }
        },
        26: {
            1: {
                "recipe_name": "《北冥剑气·两仪化形》参悟绝章"
            }
        },
        84: {
            1: {
                "recipe_name": "《北冥剑气·四象轮回》秘诀残页"
            }
        },
        85: {
            1: {
                "recipe_name": "《北冥剑气·四象轮回》秘诀断篇"
            }
        },
        86: {
            1: {
                "recipe_name": "《北冥剑气·四象轮回》秘诀绝章"
            }
        },
        92: {
            1: {
                "recipe_name": "《北冥剑气·太极无极》秘诀残页"
            }
        },
        93: {
            1: {
                "recipe_name": "《北冥剑气·太极无极》秘诀断篇"
            }
        },
        94: {
            1: {
                "recipe_name": "《北冥剑气·太极无极》秘诀绝章"
            }
        },
        97: {
            1: {
                "recipe_name": "《北冥剑气·太极无极》参悟残页"
            }
        },
        98: {
            1: {
                "recipe_name": "《北冥剑气·太极无极》参悟断篇"
            }
        },
        99: {
            1: {
                "recipe_name": "《北冥剑气·太极无极》参悟绝章"
            }
        },
        1581: {
            1: {
                "recipe_name": "《北冥剑气·万世不竭》参悟残页"
            }
        },
        1582: {
            1: {
                "recipe_name": "《北冥剑气·万世不竭》参悟断篇"
            }
        },
        1583: {
            1: {
                "recipe_name": "《北冥剑气·万世不竭》参悟绝章"
            }
        },
        818: {
            1: {
                "recipe_name": "PVE6件套_剑纯"
            },
            2: {
                "recipe_name": "PVE6件套_气纯"
            },
            3: {
                "recipe_name": "PVE6件套_冰心"
            },
            5: {
                "recipe_name": "PVE6件套_易经"
            },
            6: {
                "recipe_name": "PVE6件套_藏剑"
            },
            7: {
                "recipe_name": "PVE6件套_毒经"
            }
        },
        4602: {
            1: {
                "recipe_name": "万世不竭10%PVE"
            }
        },
        1520: {
            1: {
                "recipe_name": "90级气纯橙武属性1"
            }
        },
        1521: {
            1: {
                "recipe_name": "90级气纯橙武属性2"
            }
        },
        1136: {
            1: {
                "recipe_name": "小橙武_紫霞"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        3253: {
            1: {
                "recipe_name": "爆叠刃血量提高"
            }
        },
        5756: {
            1: {
                "recipe_name": "橙武万世加伤害"
            }
        },
        5611: {
            1: {
                "recipe_name": "流转四象会心提高"
            },
            2: {
                "recipe_name": "流转四象会心提高"
            },
            3: {
                "recipe_name": "流转四象会心提高"
            },
            4: {
                "recipe_name": "流转四象会心提高"
            },
            5: {
                "recipe_name": "流转四象会心提高"
            },
            6: {
                "recipe_name": "流转四象会心提高"
            }
        },
        5614: {
            1: {
                "recipe_name": "流转万世二段会心提高"
            },
            2: {
                "recipe_name": "流转万世二段会心提高"
            },
            3: {
                "recipe_name": "流转万世二段会心提高"
            },
            4: {
                "recipe_name": "流转万世二段会心提高"
            },
            5: {
                "recipe_name": "流转万世二段会心提高"
            },
            6: {
                "recipe_name": "流转万世二段会心提高"
            }
        },
        5615: {
            1: {
                "recipe_name": "流转两仪会心提高"
            },
            2: {
                "recipe_name": "流转两仪会心提高"
            },
            3: {
                "recipe_name": "流转两仪会心提高"
            },
            4: {
                "recipe_name": "流转两仪会心提高"
            },
            5: {
                "recipe_name": "流转两仪会心提高"
            },
            6: {
                "recipe_name": "流转两仪会心提高"
            }
        },
        2360: {
            1: {
                "recipe_name": "六合伤害10%"
            }
        },
        2361: {
            1: {
                "recipe_name": "六合伤害20%"
            }
        },
        2362: {
            1: {
                "recipe_name": "六合伤害30%"
            }
        },
        2363: {
            1: {
                "recipe_name": "六合伤害40%"
            }
        },
        4471: {
            1: {
                "recipe_name": "四象轮回伤害提高25%"
            }
        },
        4476: {
            1: {
                "recipe_name": "两仪化形伤害提高25%"
            }
        },
        6030: {
            1: {
                "recipe_name": "万世不竭伤害提升25%"
            }
        },
        5172: {
            1: {
                "recipe_name": "气剑增伤"
            }
        },
        2582: {
            1: {
                "recipe_name": "太极无极加调息"
            }
        },
        2399: {
            1: {
                "recipe_name": "镇山河降低2分钟调息时间"
            }
        },
        2400: {
            1: {
                "recipe_name": "镇山河加强降低2分钟调息时间"
            }
        },
        5305: {
            1: {
                "recipe_name": "镇山河破势减cd"
            }
        },
        5872: {
            1: {
                "recipe_name": "坐忘加CD"
            }
        },
        5875: {
            1: {
                "recipe_name": "不争坐忘加CD"
            }
        },
        4853: {
            1: {
                "recipe_name": "生太极调息时间降低1秒"
            }
        },
        4854: {
            1: {
                "recipe_name": "破苍穹减1秒"
            }
        },
        4855: {
            1: {
                "recipe_name": "剑出鸿蒙减1秒"
            }
        },
        4856: {
            1: {
                "recipe_name": "碎星辰减1秒"
            }
        },
        4857: {
            1: {
                "recipe_name": "吞日月减1秒"
            }
        },
        4858: {
            1: {
                "recipe_name": "行天道减1秒"
            }
        },
        4870: {
            1: {
                "recipe_name": "化三清减1秒"
            }
        },
        4859: {
            1: {
                "recipe_name": "飞剑1段伤害提高100%"
            }
        },
        4860: {
            1: {
                "recipe_name": "飞剑2"
            }
        },
        4861: {
            1: {
                "recipe_name": "飞剑3"
            }
        },
        4862: {
            1: {
                "recipe_name": "飞剑4"
            }
        },
        4863: {
            1: {
                "recipe_name": "飞剑5"
            }
        },
        4864: {
            1: {
                "recipe_name": "移动飞剑1"
            }
        },
        4865: {
            1: {
                "recipe_name": "移动飞剑2"
            }
        },
        4866: {
            1: {
                "recipe_name": "移动飞剑3"
            }
        },
        4867: {
            1: {
                "recipe_name": "移动飞剑4"
            }
        },
        4868: {
            1: {
                "recipe_name": "移动飞剑5"
            }
        },
        5604: {
            1: {
                "recipe_name": "破苍穹无CD"
            }
        },
        2235: {
            1: {
                "recipe_name": "剑气_韬光减CD"
            }
        },
        4953: {
            1: {
                "recipe_name": "坐忘透支"
            }
        },
        4876: {
            1: {
                "recipe_name": "九转充能"
            }
        },
        5771: {
            1: {
                "recipe_name": "四象减读条（心固）"
            }
        },
        5963: {
            1: {
                "recipe_name": "心固移动四象"
            }
        },
        5423: {
            1: {
                "recipe_name": "五方加CD"
            }
        }
    },
    10015: {
        60: {
            1: {
                "recipe_name": "《天道剑势·人剑合一》参悟残页"
            }
        },
        61: {
            1: {
                "recipe_name": "《天道剑势·人剑合一》参悟断篇"
            }
        },
        65: {
            1: {
                "recipe_name": "《天道剑势·三环套月》秘诀残页"
            }
        },
        66: {
            1: {
                "recipe_name": "《天道剑势·三环套月》秘诀断篇"
            }
        },
        67: {
            1: {
                "recipe_name": "《天道剑势·三环套月》秘诀绝章"
            }
        },
        70: {
            1: {
                "recipe_name": "《天道剑势·三环套月》参悟残页"
            }
        },
        71: {
            1: {
                "recipe_name": "《天道剑势·三环套月》参悟断篇"
            }
        },
        72: {
            1: {
                "recipe_name": "《天道剑势·三环套月》参悟绝章"
            }
        },
        100: {
            1: {
                "recipe_name": "《天道剑势·无我无剑》秘诀残页"
            }
        },
        101: {
            1: {
                "recipe_name": "《天道剑势·无我无剑》秘诀断篇"
            }
        },
        102: {
            1: {
                "recipe_name": "《天道剑势·无我无剑》秘诀绝章"
            }
        },
        105: {
            1: {
                "recipe_name": "《天道剑势·无我无剑》参悟残页"
            }
        },
        106: {
            1: {
                "recipe_name": "《天道剑势·无我无剑》参悟断篇"
            }
        },
        107: {
            1: {
                "recipe_name": "《天道剑势·无我无剑》参悟绝章"
            }
        },
        1589: {
            1: {
                "recipe_name": "《天道剑势·八荒归元》参悟残页"
            }
        },
        1590: {
            1: {
                "recipe_name": "《天道剑势·八荒归元》参悟断篇"
            }
        },
        1591: {
            1: {
                "recipe_name": "《天道剑势·八荒归元》参悟绝章"
            }
        },
        818: {
            1: {
                "recipe_name": "PVE6件套_剑纯"
            },
            2: {
                "recipe_name": "PVE6件套_气纯"
            },
            3: {
                "recipe_name": "PVE6件套_冰心"
            },
            5: {
                "recipe_name": "PVE6件套_易经"
            },
            6: {
                "recipe_name": "PVE6件套_藏剑"
            },
            7: {
                "recipe_name": "PVE6件套_毒经"
            }
        },
        1522: {
            1: {
                "recipe_name": "90级剑纯橙武属性1"
            }
        },
        1523: {
            1: {
                "recipe_name": "90级剑纯橙武属性2"
            }
        },
        1135: {
            1: {
                "recipe_name": "小橙武_太虚"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        716: {
            1: {
                "recipe_name": "匣中_凌太虚效果1"
            },
            2: {
                "recipe_name": "匣中_凌太虚效果2"
            }
        },
        717: {
            1: {
                "recipe_name": "匣中_碎星辰效果1"
            },
            2: {
                "recipe_name": "匣中_碎星辰效果2"
            }
        },
        5772: {
            1: {
                "recipe_name": "三环伤害提高"
            }
        },
        3253: {
            1: {
                "recipe_name": "爆叠刃血量提高"
            }
        },
        5758: {
            1: {
                "recipe_name": "橙武八荒增伤"
            }
        },
        2860: {
            1: {
                "recipe_name": "无我无剑减疗增伤"
            }
        },
        5923: {
            1: {
                "recipe_name": "人剑加CD"
            }
        },
        5932: {
            1: {
                "recipe_name": "人剑合一加5尺"
            }
        },
        5605: {
            1: {
                "recipe_name": "碎星辰无CD"
            }
        },
        4583: {
            1: {
                "recipe_name": "叠刃伤害提高"
            }
        },
        5173: {
            1: {
                "recipe_name": "万剑归宗减CD"
            }
        },
        5676: {
            1: {
                "recipe_name": "老凶年新秘籍"
            }
        },
        5986: {
            1: {
                "recipe_name": "万剑调整冷却时间"
            }
        },
        5987: {
            1: {
                "recipe_name": "万剑不占公共调息时间"
            }
        },
        5873: {
            1: {
                "recipe_name": "若水新秘籍"
            }
        },
        5997: {
            1: {
                "recipe_name": "剑冲透支"
            }
        },
        2263: {
            1: {
                "recipe_name": "无我无剑满豆加会心会效"
            }
        },
        5872: {
            1: {
                "recipe_name": "坐忘加CD"
            }
        },
        5875: {
            1: {
                "recipe_name": "不争坐忘加CD"
            }
        },
        5722: {
            1: {
                "recipe_name": "八荒降低CD"
            }
        },
        4853: {
            1: {
                "recipe_name": "生太极调息时间降低1秒"
            }
        },
        4854: {
            1: {
                "recipe_name": "破苍穹减1秒"
            }
        },
        4855: {
            1: {
                "recipe_name": "剑出鸿蒙减1秒"
            }
        },
        4856: {
            1: {
                "recipe_name": "碎星辰减1秒"
            }
        },
        4857: {
            1: {
                "recipe_name": "吞日月减1秒"
            }
        },
        4858: {
            1: {
                "recipe_name": "行天道减1秒"
            }
        },
        4870: {
            1: {
                "recipe_name": "化三清减1秒"
            }
        }
    },
    10021: {
        490: {
            1: {
                "recipe_name": "《点穴截脉·阳明指》秘诀残页"
            }
        },
        491: {
            1: {
                "recipe_name": "《点穴截脉·阳明指》秘诀断篇"
            }
        },
        492: {
            1: {
                "recipe_name": "《点穴截脉·阳明指》参悟残页"
            }
        },
        493: {
            1: {
                "recipe_name": "《点穴截脉·阳明指》参悟断篇"
            }
        },
        1677: {
            1: {
                "recipe_name": "《百花拂穴手·快雪时晴》参悟残页"
            }
        },
        1678: {
            1: {
                "recipe_name": "《百花拂穴手·快雪时晴》参悟断篇"
            }
        },
        1679: {
            1: {
                "recipe_name": "《百花拂穴手·快雪时晴》参悟绝章"
            }
        },
        4904: {
            1: {
                "recipe_name": "《百花拂穴手·芙蓉并蒂》秘诀残页"
            }
        },
        4905: {
            1: {
                "recipe_name": "《百花拂穴手·芙蓉并蒂》秘诀断篇"
            }
        },
        4906: {
            1: {
                "recipe_name": "《百花拂穴手·芙蓉并蒂》秘诀绝章"
            }
        },
        4907: {
            1: {
                "recipe_name": "《百花拂穴手·芙蓉并蒂》参悟残页"
            }
        },
        4908: {
            1: {
                "recipe_name": "《百花拂穴手·芙蓉并蒂》参悟断篇"
            }
        },
        4909: {
            1: {
                "recipe_name": "《百花拂穴手·芙蓉并蒂》参悟绝章"
            }
        },
        817: {
            1: {
                "recipe_name": "PVE6件套_花间"
            },
            2: {
                "recipe_name": "PVE6件套_傲血"
            }
        },
        1546: {
            1: {
                "recipe_name": "花间PVE套装属性快雪"
            }
        },
        1516: {
            1: {
                "recipe_name": "90级花间橙武属性1"
            }
        },
        1517: {
            1: {
                "recipe_name": "90级花间橙武属性2"
            }
        },
        1131: {
            1: {
                "recipe_name": "小橙武_花间"
            }
        },
        1979: {
            1: {
                "recipe_name": "小橙武_花间_快雪"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        2940: {
            1: {
                "recipe_name": "飞白加兰摧伤害"
            }
        },
        2941: {
            1: {
                "recipe_name": "飞白加商阳伤害"
            }
        },
        2942: {
            1: {
                "recipe_name": "飞白加钟林伤害"
            }
        },
        5832: {
            1: {
                "recipe_name": "快雪20攻击加成_雪弃"
            }
        },
        5831: {
            1: {
                "recipe_name": "快雪20攻击加成"
            }
        },
        2323: {
            1: {
                "recipe_name": "芙蓉降低5秒调息时间"
            }
        },
        5164: {
            1: {
                "recipe_name": "快雪加cd加跳数"
            }
        },
        4661: {
            1: {
                "recipe_name": "十二跳Dot快雪伤害单次提高"
            }
        },
        2439: {
            1: {
                "recipe_name": "故幽加芙蓉会心"
            }
        },
        2440: {
            1: {
                "recipe_name": "故幽加轻弃商阳会心"
            }
        },
        2441: {
            1: {
                "recipe_name": "故幽加兰摧会心"
            }
        },
        2442: {
            1: {
                "recipe_name": "故幽加钟林会心"
            }
        },
        2443: {
            1: {
                "recipe_name": "故幽加兰摧唯二会心"
            }
        },
        3151: {
            1: {
                "recipe_name": "故幽加快雪时晴dot会心"
            }
        },
        1299: {
            1: {
                "recipe_name": "快雪时晴_加伤害"
            },
            2: {
                "recipe_name": "快雪时晴_加伤害"
            }
        },
        5497: {
            1: {
                "recipe_name": "新青歌快雪双会10%"
            }
        },
        5128: {
            1: {
                "recipe_name": "兰摧玉折减读条"
            }
        },
        5129: {
            1: {
                "recipe_name": "钟林毓秀减读条"
            }
        },
        5642: {
            1: {
                "recipe_name": "兰催走读"
            }
        },
        5643: {
            1: {
                "recipe_name": "钟林走读"
            }
        },
        1301: {
            1: {
                "recipe_name": "商阳指加伤害"
            }
        },
        1302: {
            1: {
                "recipe_name": "钟林毓秀伤害"
            }
        },
        1303: {
            1: {
                "recipe_name": "兰摧玉折加伤害"
            }
        },
        3199: {
            1: {
                "recipe_name": "雪弃快雪dot伤害增加5%"
            }
        },
        5975: {
            1: {
                "recipe_name": "雪弃快雪增伤10%"
            }
        },
        4695: {
            1: {
                "recipe_name": "清新加30秒CD"
            }
        },
        5333: {
            1: {
                "recipe_name": "乱洒充能"
            }
        },
        4380: {
            1: {
                "recipe_name": "太阴指_变为充能"
            },
            2: {
                "recipe_name": "太阴指_轻燕_充能+减伤"
            }
        },
        5477: {
            1: {
                "recipe_name": "水月_变为充能"
            }
        }
    },
    10026: {
        334: {
            1: {
                "recipe_name": "《羽林枪法·穿云》秘诀残页"
            }
        },
        335: {
            1: {
                "recipe_name": "《羽林枪法·穿云》秘诀断篇"
            }
        },
        338: {
            1: {
                "recipe_name": "《羽林枪法·穿云》参悟残页"
            }
        },
        339: {
            1: {
                "recipe_name": "《羽林枪法·穿云》参悟断篇"
            }
        },
        345: {
            1: {
                "recipe_name": "《游龙骑法·断魂刺》参悟残页"
            }
        },
        346: {
            1: {
                "recipe_name": "《游龙骑法·断魂刺》参悟断篇"
            }
        },
        355: {
            1: {
                "recipe_name": "《羽林枪法·龙牙》秘诀绝章"
            }
        },
        356: {
            1: {
                "recipe_name": "《羽林枪法·龙牙》参悟绝章"
            }
        },
        357: {
            1: {
                "recipe_name": "《羽林枪法·龙牙》秘诀残页"
            }
        },
        358: {
            1: {
                "recipe_name": "《羽林枪法·龙牙》秘诀断篇"
            }
        },
        361: {
            1: {
                "recipe_name": "《羽林枪法·龙牙》参悟残页"
            }
        },
        362: {
            1: {
                "recipe_name": "《羽林枪法·龙牙》参悟断篇"
            }
        },
        367: {
            1: {
                "recipe_name": "《奔雷枪术·灭》秘诀残页"
            }
        },
        368: {
            1: {
                "recipe_name": "《奔雷枪术·灭》秘诀断篇"
            }
        },
        369: {
            1: {
                "recipe_name": "《奔雷枪术·灭》参悟残页"
            }
        },
        370: {
            1: {
                "recipe_name": "《奔雷枪术·灭》参悟断篇"
            }
        },
        398: {
            1: {
                "recipe_name": "《奔雷枪术·突》参悟残页"
            }
        },
        399: {
            1: {
                "recipe_name": "《奔雷枪术·突》参悟断篇"
            }
        },
        1557: {
            1: {
                "recipe_name": "《羽林枪法·龙吟》参悟残页"
            }
        },
        1558: {
            1: {
                "recipe_name": "《羽林枪法·龙吟》参悟断篇"
            }
        },
        1559: {
            1: {
                "recipe_name": "《羽林枪法·龙吟》参悟绝章"
            }
        },
        817: {
            1: {
                "recipe_name": "PVE6件套_花间"
            },
            2: {
                "recipe_name": "PVE6件套_傲血"
            }
        },
        1508: {
            1: {
                "recipe_name": "90级傲血橙武属性1"
            }
        },
        1509: {
            1: {
                "recipe_name": "90级傲血橙武属性2"
            }
        },
        1133: {
            1: {
                "recipe_name": "小橙武_傲血"
            }
        },
        4892: {
            1: {
                "recipe_name": "心法提高沧月威胁值"
            }
        },
        1110: {
            1: {
                "recipe_name": "日影_疾眩晕1"
            },
            2: {
                "recipe_name": "日影_疾眩晕2"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        3257: {
            1: {
                "recipe_name": "流血伤害提高20%"
            }
        },
        4504: {
            1: {
                "recipe_name": "战意提高5%穿云伤害"
            },
            2: {
                "recipe_name": "战意提高10%穿云伤害"
            },
            3: {
                "recipe_name": "战意提高15%穿云伤害"
            },
            4: {
                "recipe_name": "战意提高20%穿云伤害"
            },
            5: {
                "recipe_name": "战意提高25%穿云伤害"
            }
        },
        4505: {
            1: {
                "recipe_name": "战意提高5%龙吟伤害"
            },
            2: {
                "recipe_name": "战意提高10%龙吟伤害"
            },
            3: {
                "recipe_name": "战意提高15%龙吟伤害"
            },
            4: {
                "recipe_name": "战意提高20%龙吟伤害"
            },
            5: {
                "recipe_name": "战意提高25%龙吟伤害"
            }
        },
        4506: {
            1: {
                "recipe_name": "战意提高5%龙牙伤害"
            },
            2: {
                "recipe_name": "战意提高10%龙牙伤害"
            },
            3: {
                "recipe_name": "战意提高15%龙牙伤害"
            },
            4: {
                "recipe_name": "战意提高20%龙牙伤害"
            },
            5: {
                "recipe_name": "战意提高25%龙牙伤害"
            }
        },
        4507: {
            1: {
                "recipe_name": "战意提高5%灭伤害"
            },
            2: {
                "recipe_name": "战意提高10%灭伤害"
            },
            3: {
                "recipe_name": "战意提高15%灭伤害"
            },
            4: {
                "recipe_name": "战意提高20%灭伤害"
            },
            5: {
                "recipe_name": "战意提高25%灭伤害"
            }
        },
        2309: {
            1: {
                "recipe_name": "突变2层充能"
            }
        },
        4961: {
            1: {
                "recipe_name": "流血提高跳数"
            }
        },
        5158: {
            1: {
                "recipe_name": "任驰骋减CD"
            }
        },
        1231: {
            1: {
                "recipe_name": "灭增强"
            }
        },
        1776: {
            1: {
                "recipe_name": "傲雪白羽突加CD"
            }
        },
        6109: {
            1: {
                "recipe_name": "战八方加作用范围和受击个数"
            }
        },
        2482: {
            1: {
                "recipe_name": "战八方会心会效果提高"
            }
        },
        3068: {
            1: {
                "recipe_name": "任驰骋不读条释放"
            }
        },
        4894: {
            1: {
                "recipe_name": "龙牙距离提高"
            }
        },
        2365: {
            1: {
                "recipe_name": "马上战八方6秒"
            }
        },
        2498: {
            1: {
                "recipe_name": "2层流血间隔缩短"
            }
        },
        4893: {
            1: {
                "recipe_name": "御去掉公共调息"
            }
        }
    },
    10081: {
        143: {
            1: {
                "recipe_name": "《猿公剑法·剑气长江》秘诀残页"
            }
        },
        144: {
            1: {
                "recipe_name": "《猿公剑法·剑气长江》秘诀断篇"
            }
        },
        145: {
            1: {
                "recipe_name": "《猿公剑法·剑气长江》参悟残页"
            }
        },
        146: {
            1: {
                "recipe_name": "《猿公剑法·剑气长江》参悟断篇"
            }
        },
        155: {
            1: {
                "recipe_name": "《西河剑器·江海凝光》秘诀残页"
            }
        },
        156: {
            1: {
                "recipe_name": "《西河剑器·江海凝光》秘诀断篇"
            }
        },
        160: {
            1: {
                "recipe_name": "《西河剑器·江海凝光》参悟残页"
            }
        },
        161: {
            1: {
                "recipe_name": "《西河剑器·江海凝光》参悟断篇"
            }
        },
        1637: {
            1: {
                "recipe_name": "《西河剑器·玳弦急曲》参悟残页"
            }
        },
        1638: {
            1: {
                "recipe_name": "《西河剑器·玳弦急曲》参悟断篇"
            }
        },
        1639: {
            1: {
                "recipe_name": "《西河剑器·玳弦急曲》参悟绝章"
            }
        },
        1547: {
            1: {
                "recipe_name": "七秀PVE套装属性剑破"
            }
        },
        1524: {
            1: {
                "recipe_name": "90级冰心橙武属性1"
            }
        },
        1525: {
            1: {
                "recipe_name": "90级冰心橙武属性2"
            }
        },
        1137: {
            1: {
                "recipe_name": "小橙武_冰心"
            }
        },
        1977: {
            1: {
                "recipe_name": "小橙武_冰心_剑破"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        680: {
            1: {
                "recipe_name": "磷光_满堂势效果1"
            },
            2: {
                "recipe_name": "磷光_满堂势效果2"
            }
        },
        681: {
            1: {
                "recipe_name": "入丛_龙池乐效果1"
            },
            2: {
                "recipe_name": "入丛_龙池乐效果2"
            }
        },
        3246: {
            1: {
                "recipe_name": "流玉_下一个玳弦急曲加伤害"
            }
        },
        5787: {
            1: {
                "recipe_name": "玳弦急曲剑舞减读条"
            },
            2: {
                "recipe_name": "玳弦急曲剑舞减读条"
            },
            3: {
                "recipe_name": "玳弦急曲剑舞减读条"
            },
            4: {
                "recipe_name": "玳弦急曲剑舞减读条"
            },
            5: {
                "recipe_name": "玳弦急曲剑舞减读条"
            },
            6: {
                "recipe_name": "玳弦急曲剑舞减读条"
            }
        },
        5788: {
            1: {
                "recipe_name": "玳弦急曲剑舞减读条（新妆）"
            },
            2: {
                "recipe_name": "玳弦急曲剑舞减读条（新妆）"
            },
            3: {
                "recipe_name": "玳弦急曲剑舞减读条（新妆）"
            },
            4: {
                "recipe_name": "玳弦急曲剑舞减读条（新妆）"
            },
            5: {
                "recipe_name": "玳弦急曲剑舞减读条（新妆）"
            },
            6: {
                "recipe_name": "玳弦急曲剑舞减读条（新妆）"
            }
        },
        5651: {
            1: {
                "recipe_name": "江海提高50%"
            }
        },
        5802: {
            1: {
                "recipe_name": "剑破虚空充能3层"
            }
        },
        1254: {
            1: {
                "recipe_name": "剑破加伤害"
            }
        },
        5890: {
            1: {
                "recipe_name": "生莲加伤害"
            }
        },
        3247: {
            1: {
                "recipe_name": "流玉_剑影留痕距离+10"
            }
        },
        5506: {
            1: {
                "recipe_name": "七秀_冰心_珠袖"
            }
        },
        5660: {
            1: {
                "recipe_name": "剑破虚空减5秒cd"
            }
        },
        2350: {
            1: {
                "recipe_name": "鹊踏枝降低45秒_新"
            }
        },
        5784: {
            1: {
                "recipe_name": "水榭花盈减CD技能本身·新"
            }
        },
        5785: {
            1: {
                "recipe_name": "水榭花盈减cd·新"
            }
        },
        4334: {
            1: {
                "recipe_name": "蝶弄足调息减25秒"
            }
        },
        1500: {
            1: {
                "recipe_name": "玳弦急曲额外伤害"
            }
        },
        1248: {
            1: {
                "recipe_name": "玳弦急曲没有dot"
            }
        },
        1801: {
            1: {
                "recipe_name": "4层dot玳弦急曲不加dot"
            }
        },
        1498: {
            1: {
                "recipe_name": "玳弦急曲加速"
            }
        },
        1249: {
            1: {
                "recipe_name": "玳弦急曲AOE"
            }
        },
        1926: {
            1: {
                "recipe_name": "玳弦急曲不被打退（新）"
            }
        },
        4112: {
            1: {
                "recipe_name": "繁音急节变充能"
            }
        },
        1251: {
            1: {
                "recipe_name": "帝骖龙翔减cd"
            }
        },
        3007: {
            1: {
                "recipe_name": "钗燕雷霆减cd新"
            }
        },
        2894: {
            1: {
                "recipe_name": "缠竹减雷霆cd"
            }
        },
        2494: {
            1: {
                "recipe_name": "江海凝光会心提高10%"
            }
        }
    },
    10144: {
        545: {
            1: {
                "recipe_name": "《秀水剑法·平湖断月》秘诀残页"
            }
        },
        546: {
            1: {
                "recipe_name": "《秀水剑法·平湖断月》参悟残页"
            }
        },
        547: {
            1: {
                "recipe_name": "《秀水剑法·平湖断月》参悟断篇"
            }
        },
        548: {
            1: {
                "recipe_name": "《秀水剑法·平湖断月》参悟绝章"
            }
        },
        552: {
            1: {
                "recipe_name": "《秀水剑法·黄龙吐翠》秘诀残页"
            }
        },
        553: {
            1: {
                "recipe_name": "《秀水剑法·黄龙吐翠》秘诀断篇"
            }
        },
        554: {
            1: {
                "recipe_name": "《秀水剑法·黄龙吐翠》秘诀绝章"
            }
        },
        555: {
            1: {
                "recipe_name": "《秀水剑法·黄龙吐翠》参悟残页"
            }
        },
        556: {
            1: {
                "recipe_name": "《秀水剑法·黄龙吐翠》参悟断篇"
            }
        },
        557: {
            1: {
                "recipe_name": "《秀水剑法·黄龙吐翠》参悟绝章"
            }
        },
        560: {
            1: {
                "recipe_name": "《秀水剑法·九溪弥烟》秘诀残页"
            }
        },
        561: {
            1: {
                "recipe_name": "《秀水剑法·九溪弥烟》秘诀断篇"
            }
        },
        562: {
            1: {
                "recipe_name": "《秀水剑法·九溪弥烟》参悟残页"
            }
        },
        563: {
            1: {
                "recipe_name": "《秀水剑法·九溪弥烟》参悟断篇"
            }
        },
        564: {
            1: {
                "recipe_name": "《秀水剑法·九溪弥烟》参悟绝章"
            }
        },
        594: {
            1: {
                "recipe_name": "《君子风·听雷》秘诀残页"
            }
        },
        595: {
            1: {
                "recipe_name": "《君子风·听雷》秘诀断篇"
            }
        },
        596: {
            1: {
                "recipe_name": "《君子风·听雷》参悟残页"
            }
        },
        597: {
            1: {
                "recipe_name": "《君子风·听雷》参悟断篇"
            }
        },
        598: {
            1: {
                "recipe_name": "《君子风·听雷》参悟绝章"
            }
        },
        1573: {
            1: {
                "recipe_name": "《秀水剑法·梦泉虎跑》参悟残页"
            }
        },
        1574: {
            1: {
                "recipe_name": "《秀水剑法·梦泉虎跑》参悟断篇"
            }
        },
        1575: {
            1: {
                "recipe_name": "《秀水剑法·梦泉虎跑》参悟绝章"
            }
        },
        1576: {
            1: {
                "recipe_name": "《秀水剑法·梦泉虎跑》秘诀残页"
            }
        },
        569: {
            1: {
                "recipe_name": "《灵峰剑式·云飞玉皇》参悟残页"
            }
        },
        570: {
            1: {
                "recipe_name": "《灵峰剑式·云飞玉皇》参悟断篇"
            }
        },
        571: {
            1: {
                "recipe_name": "《灵峰剑式·云飞玉皇》参悟绝章"
            }
        },
        574: {
            1: {
                "recipe_name": "《灵峰剑式·云飞玉皇》秘诀残页"
            }
        },
        579: {
            1: {
                "recipe_name": "《灵峰剑式·夕照雷峰》参悟残页"
            }
        },
        580: {
            1: {
                "recipe_name": "《灵峰剑式·夕照雷峰》参悟断篇"
            }
        },
        581: {
            1: {
                "recipe_name": "《灵峰剑式·夕照雷峰》参悟绝章"
            }
        },
        582: {
            1: {
                "recipe_name": "《灵峰剑式·夕照雷峰》秘诀残页"
            }
        },
        583: {
            1: {
                "recipe_name": "《灵峰剑式·风来吴山》参悟残页"
            }
        },
        584: {
            1: {
                "recipe_name": "《灵峰剑式·风来吴山》参悟断篇"
            }
        },
        585: {
            1: {
                "recipe_name": "《灵峰剑式·风来吴山》参悟绝章"
            }
        },
        588: {
            1: {
                "recipe_name": "《灵峰剑式·风来吴山》秘诀残页"
            }
        },
        589: {
            1: {
                "recipe_name": "《灵峰剑式·风来吴山》秘诀断篇"
            }
        },
        1565: {
            1: {
                "recipe_name": "《灵峰剑式·鹤归孤山》参悟残页"
            }
        },
        1566: {
            1: {
                "recipe_name": "《灵峰剑式·鹤归孤山》参悟断篇"
            }
        },
        1567: {
            1: {
                "recipe_name": "《灵峰剑式·鹤归孤山》参悟绝章"
            }
        },
        1568: {
            1: {
                "recipe_name": "《灵峰剑式·鹤归孤山》秘诀残页"
            }
        },
        818: {
            1: {
                "recipe_name": "PVE6件套_剑纯"
            },
            2: {
                "recipe_name": "PVE6件套_气纯"
            },
            3: {
                "recipe_name": "PVE6件套_冰心"
            },
            5: {
                "recipe_name": "PVE6件套_易经"
            },
            6: {
                "recipe_name": "PVE6件套_藏剑"
            },
            7: {
                "recipe_name": "PVE6件套_毒经"
            }
        },
        4347: {
            1: {
                "recipe_name": "PVE藏剑两件套_听雷伤害"
            }
        },
        1536: {
            1: {
                "recipe_name": "90级问水橙武属性1"
            }
        },
        1590: {
            1: {
                "recipe_name": "《天道剑势·八荒归元》参悟断篇"
            }
        },
        1538: {
            1: {
                "recipe_name": "90级山居橙武属性1"
            }
        },
        1539: {
            1: {
                "recipe_name": "90级山居橙武属性2"
            }
        },
        1141: {
            1: {
                "recipe_name": "小橙武_问水"
            }
        },
        1142: {
            1: {
                "recipe_name": "小橙武_山居"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        4087: {
            1: {
                "recipe_name": "奔浪_探梅加速"
            },
            2: {
                "recipe_name": "奔浪_探梅加速2"
            }
        },
        2817: {
            1: {
                "recipe_name": "层云风车递增5%"
            }
        },
        2818: {
            1: {
                "recipe_name": "层云风车递增10%"
            }
        },
        2819: {
            1: {
                "recipe_name": "层云风车递增15%"
            }
        },
        2820: {
            1: {
                "recipe_name": "层云风车递增20%"
            }
        },
        2821: {
            1: {
                "recipe_name": "层云风车递增25%"
            }
        },
        2445: {
            1: {
                "recipe_name": "云飞15会心15伤害"
            }
        },
        2446: {
            1: {
                "recipe_name": "夕照15会心15伤害"
            }
        },
        2599: {
            1: {
                "recipe_name": "断潮加100%伤害"
            }
        },
        2882: {
            1: {
                "recipe_name": "造化高剑气夕照15伤害"
            }
        },
        2883: {
            1: {
                "recipe_name": "造化高剑气云飞15伤害"
            }
        },
        3280: {
            1: {
                "recipe_name": "碧归夕照加成"
            }
        },
        3281: {
            1: {
                "recipe_name": "碧归云飞加成"
            }
        },
        3282: {
            1: {
                "recipe_name": "碧归鹤归加成"
            }
        },
        5672: {
            1: {
                "recipe_name": "莺鸣柳减45秒"
            }
        },
        6018: {
            1: {
                "recipe_name": "云飞加10%伤害"
            }
        },
        4964: {
            1: {
                "recipe_name": "风车持续时间降低攻速提高"
            }
        },
        2447: {
            1: {
                "recipe_name": "风来吴山透支"
            }
        },
        4477: {
            1: {
                "recipe_name": "景行_九溪弥烟增加调息"
            }
        },
        4963: {
            1: {
                "recipe_name": "平湖无公CD和加距离"
            }
        },
        3178: {
            1: {
                "recipe_name": "重剑听雷伤害10%"
            }
        },
        2740: {
            1: {
                "recipe_name": "撼岳山居听雷加10%伤害"
            }
        },
        2347: {
            1: {
                "recipe_name": "峰插云景无消耗"
            }
        },
        5670: {
            1: {
                "recipe_name": "夕照10%伤害"
            }
        },
        2246: {
            1: {
                "recipe_name": "碧归_风来吴山无消耗"
            }
        },
        4510: {
            1: {
                "recipe_name": "碧归_原地风车减消耗"
            }
        },
        6025: {
            1: {
                "recipe_name": "啸日减7秒"
            }
        },
        4417: {
            1: {
                "recipe_name": "浮云_峰插云景增加范围目标"
            }
        }
    },
    10175: {
        746: {
            1: {
                "recipe_name": "《引魂蛊术·灵蛊》参悟残页"
            }
        },
        747: {
            1: {
                "recipe_name": "《引魂蛊术·灵蛊》参悟断篇"
            }
        },
        748: {
            1: {
                "recipe_name": "《引魂蛊术·灵蛊》参悟绝章"
            }
        },
        762: {
            1: {
                "recipe_name": "《千劫万毒手·蛇影》秘诀残页"
            }
        },
        763: {
            1: {
                "recipe_name": "《千劫万毒手·蛇影》秘诀断篇"
            }
        },
        764: {
            1: {
                "recipe_name": "《千劫万毒手·蛇影》秘诀绝章"
            }
        },
        767: {
            1: {
                "recipe_name": "《千劫万毒手·蛇影》参悟残页"
            }
        },
        768: {
            1: {
                "recipe_name": "《千劫万毒手·蛇影》参悟断篇"
            }
        },
        773: {
            1: {
                "recipe_name": "《千劫万毒手·百足》参悟绝章"
            }
        },
        774: {
            1: {
                "recipe_name": "《千劫万毒手·百足》参悟残页"
            }
        },
        775: {
            1: {
                "recipe_name": "《千劫万毒手·百足》参悟断篇"
            }
        },
        794: {
            1: {
                "recipe_name": "《千劫万毒手·蝎心》秘诀残页"
            }
        },
        795: {
            1: {
                "recipe_name": "《千劫万毒手·蝎心》秘诀断篇"
            }
        },
        796: {
            1: {
                "recipe_name": "《千劫万毒手·蝎心》参悟残页"
            }
        },
        797: {
            1: {
                "recipe_name": "《千劫万毒手·蝎心》参悟断篇"
            }
        },
        818: {
            1: {
                "recipe_name": "PVE6件套_剑纯"
            },
            2: {
                "recipe_name": "PVE6件套_气纯"
            },
            3: {
                "recipe_name": "PVE6件套_冰心"
            },
            5: {
                "recipe_name": "PVE6件套_易经"
            },
            6: {
                "recipe_name": "PVE6件套_藏剑"
            },
            7: {
                "recipe_name": "PVE6件套_毒经"
            }
        },
        4678: {
            1: {
                "recipe_name": "PVE毒经加蛇影伤害"
            }
        },
        1528: {
            1: {
                "recipe_name": "90级毒经橙武属性1"
            }
        },
        1529: {
            1: {
                "recipe_name": "90级毒经橙武属性2"
            }
        },
        1143: {
            1: {
                "recipe_name": "小橙武_毒经"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        688: {
            1: {
                "recipe_name": "宠物加攻加血1"
            },
            2: {
                "recipe_name": "宠物加攻加血2"
            },
            3: {
                "recipe_name": "宠物加攻加血3"
            }
        },
        2516: {
            1: {
                "recipe_name": "连缘蛊四毒加成"
            }
        },
        5608: {
            1: {
                "recipe_name": "新蝎心增伤"
            }
        },
        6017: {
            1: {
                "recipe_name": "蝎心减0.75秒读条"
            }
        },
        1268: {
            1: {
                "recipe_name": "90奇穴_百足提高作用范围"
            }
        },
        1269: {
            1: {
                "recipe_name": "90奇穴_蛇影提高伤害"
            }
        },
        1270: {
            1: {
                "recipe_name": "90奇穴_百足提高伤害"
            }
        },
        1271: {
            1: {
                "recipe_name": "90奇穴_蟾啸提高伤害"
            }
        },
        1272: {
            1: {
                "recipe_name": "90奇穴_蝎心提高伤害"
            }
        },
        2436: {
            1: {
                "recipe_name": "毒经橙武持续伤害提高"
            }
        },
        4550: {
            1: {
                "recipe_name": "2秒百足伤害提高20%"
            }
        },
        3263: {
            1: {
                "recipe_name": "黯影_忘情蛇影伤害提高25%"
            }
        },
        5538: {
            1: {
                "recipe_name": "释灵黯影加成"
            }
        },
        6041: {
            1: {
                "recipe_name": "虫魄加目标数"
            }
        },
        3071: {
            1: {
                "recipe_name": "百足目标数+1"
            }
        },
        5891: {
            1: {
                "recipe_name": "新忘情蛇影增伤"
            }
        },
        5898: {
            1: {
                "recipe_name": "新忘情蟾啸增伤"
            }
        },
        5901: {
            1: {
                "recipe_name": "新忘情蟾啸dot增伤"
            }
        },
        3072: {
            1: {
                "recipe_name": "灵蛇引GCD"
            }
        },
        3073: {
            1: {
                "recipe_name": "玉蟾引GCD"
            }
        },
        3074: {
            1: {
                "recipe_name": "圣蝎引GCD"
            }
        },
        3075: {
            1: {
                "recipe_name": "风蜈引GCD"
            }
        },
        3076: {
            1: {
                "recipe_name": "天蛛引GCD"
            }
        },
        6019: {
            1: {
                "recipe_name": "灵蛇引不占GCD"
            }
        },
        6020: {
            1: {
                "recipe_name": "天蛛引不占GCD"
            }
        },
        6021: {
            1: {
                "recipe_name": "碧蝶引不占GCD"
            }
        },
        6022: {
            1: {
                "recipe_name": "玉蟾引不占GCD"
            }
        },
        6023: {
            1: {
                "recipe_name": "风蜈引不占GCD"
            }
        },
        6024: {
            1: {
                "recipe_name": "圣蝎引不占GCD"
            }
        },
        2500: {
            1: {
                "recipe_name": "固灵新增百足伤害加强"
            }
        },
        6031: {
            1: {
                "recipe_name": "千丝加9秒"
            }
        }
    },
    10224: {
        834: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》参悟残页"
            }
        },
        835: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》参悟断篇"
            }
        },
        836: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》参悟绝章"
            }
        },
        837: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》秘诀残页"
            }
        },
        838: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》秘诀断篇"
            }
        },
        845: {
            1: {
                "recipe_name": "《百步穿杨·夺魄箭》参悟残页"
            }
        },
        846: {
            1: {
                "recipe_name": "《百步穿杨·夺魄箭》参悟断篇"
            }
        },
        847: {
            1: {
                "recipe_name": "《百步穿杨·夺魄箭》参悟绝章"
            }
        },
        848: {
            1: {
                "recipe_name": "《百步穿杨·夺魄箭》秘诀残页"
            }
        },
        849: {
            1: {
                "recipe_name": "《百步穿杨·夺魄箭》秘诀断篇"
            }
        },
        850: {
            1: {
                "recipe_name": "《百步穿杨·夺魄箭》秘诀绝章"
            }
        },
        853: {
            1: {
                "recipe_name": "《百步穿杨·追命箭》参悟残页"
            }
        },
        854: {
            1: {
                "recipe_name": "《百步穿杨·追命箭》参悟断篇"
            }
        },
        855: {
            1: {
                "recipe_name": "《百步穿杨·追命箭》参悟绝章"
            }
        },
        856: {
            1: {
                "recipe_name": "《百步穿杨·追命箭》秘诀残页"
            }
        },
        857: {
            1: {
                "recipe_name": "《百步穿杨·追命箭》秘诀断篇"
            }
        },
        858: {
            1: {
                "recipe_name": "《百步穿杨·追命箭》人偶图残页"
            }
        },
        859: {
            1: {
                "recipe_name": "《百步穿杨·穿心弩》参悟残页"
            }
        },
        860: {
            1: {
                "recipe_name": "《百步穿杨·穿心弩》参悟断篇"
            }
        },
        1661: {
            1: {
                "recipe_name": "《百步穿杨·逐星箭》参悟残页"
            }
        },
        1662: {
            1: {
                "recipe_name": "《百步穿杨·逐星箭》参悟断篇"
            }
        },
        1663: {
            1: {
                "recipe_name": "《百步穿杨·逐星箭》参悟绝章"
            }
        },
        946: {
            1: {
                "recipe_name": "PVE6件套_箭弩"
            }
        },
        1969: {
            1: {
                "recipe_name": "PVE6件套_箭弩_暴雨10%"
            }
        },
        1534: {
            1: {
                "recipe_name": "90级惊羽橙武属性1"
            }
        },
        1535: {
            1: {
                "recipe_name": "90级惊羽橙武属性2"
            }
        },
        1145: {
            1: {
                "recipe_name": "小橙武_惊羽"
            }
        },
        1978: {
            1: {
                "recipe_name": "小橙武_唐门_暴雨"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        936: {
            1: {
                "recipe_name": "化血镖_加距离1"
            },
            2: {
                "recipe_name": "化血镖_加距离2"
            }
        },
        937: {
            1: {
                "recipe_name": "孔雀翎_加距离1"
            },
            2: {
                "recipe_name": "孔雀翎_加距离2"
            }
        },
        938: {
            1: {
                "recipe_name": "雷震子_加距离1"
            },
            2: {
                "recipe_name": "雷震子_加距离2"
            }
        },
        939: {
            1: {
                "recipe_name": "迷神钉_加距离1"
            },
            2: {
                "recipe_name": "迷神钉_加距离2"
            }
        },
        940: {
            1: {
                "recipe_name": "毒蒺藜_加距离1"
            },
            2: {
                "recipe_name": "毒蒺藜_加距离2"
            }
        },
        941: {
            1: {
                "recipe_name": "梅花针_加距离1"
            },
            2: {
                "recipe_name": "梅花针_加距离2"
            }
        },
        942: {
            1: {
                "recipe_name": "暴雨梨花针_加距离1"
            },
            2: {
                "recipe_name": "暴雨梨花针_加距离2"
            }
        },
        5145: {
            1: {
                "recipe_name": "追命无声追命伤害提高20%"
            }
        },
        5533: {
            1: {
                "recipe_name": "蹑景追风1"
            }
        },
        5945: {
            1: {
                "recipe_name": "蹑景追风1"
            }
        },
        5534: {
            1: {
                "recipe_name": "蹑景追风2"
            }
        },
        5946: {
            1: {
                "recipe_name": "蹑景追风2"
            }
        },
        5535: {
            1: {
                "recipe_name": "蹑景追风3"
            }
        },
        5947: {
            1: {
                "recipe_name": "蹑景追风3"
            }
        },
        1195: {
            1: {
                "recipe_name": "追命箭_高气血伤害"
            },
            2: {
                "recipe_name": "90奇穴_夺魄箭加伤害"
            },
            3: {
                "recipe_name": "90奇穴_夺魄箭加会心"
            }
        },
        4599: {
            1: {
                "recipe_name": "飞天双追命"
            }
        },
        1201: {
            1: {
                "recipe_name": "90奇穴_追命箭_加伤害"
            }
        },
        5201: {
            1: {
                "recipe_name": "强化弩箭制造"
            }
        },
        919: {
            1: {
                "recipe_name": "绝伦逸群_浮光掠影消失时免控"
            },
            2: {
                "recipe_name": "绝伦逸群_浮光掠影消失时免控"
            }
        },
        1991: {
            1: {
                "recipe_name": "浮光掠影减CD"
            }
        },
        5962: {
            1: {
                "recipe_name": "飞星加5秒CD"
            }
        },
        5531: {
            1: {
                "recipe_name": "牢甲利兵减少追命cd效果"
            }
        },
        1710: {
            1: {
                "recipe_name": "唐门_雷震子易伤"
            }
        },
        6152: {
            1: {
                "recipe_name": "追命箭无视50"
            }
        },
        5817: {
            1: {
                "recipe_name": "逐星箭伤害提高100%"
            }
        },
        1474: {
            1: {
                "recipe_name": "90奇穴_追命隐身伤害"
            }
        },
        1501: {
            1: {
                "recipe_name": "90奇穴_隐身追命会心会效"
            }
        },
        1207: {
            1: {
                "recipe_name": "90奇穴_心无旁骛减CD"
            }
        },
        2632: {
            1: {
                "recipe_name": "化血伤害变2秒一跳"
            }
        },
        2864: {
            1: {
                "recipe_name": "穿林打叶伤害修正"
            }
        },
        4960: {
            1: {
                "recipe_name": "惊鸿游龙减CD"
            }
        },
        6082: {
            1: {
                "recipe_name": "夺魄移动-0.25"
            }
        },
        6081: {
            1: {
                "recipe_name": "夺魄-0.25秒读条"
            }
        }
    },
    10225: {
        834: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》参悟残页"
            }
        },
        835: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》参悟断篇"
            }
        },
        836: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》参悟绝章"
            }
        },
        837: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》秘诀残页"
            }
        },
        838: {
            1: {
                "recipe_name": "《乾坤一掷·暴雨梨花针》秘诀断篇"
            }
        },
        868: {
            1: {
                "recipe_name": "《九宫飞星·蚀肌弹》经脉图残页"
            }
        },
        869: {
            1: {
                "recipe_name": "《九宫飞星·蚀肌弹》经脉图断篇"
            }
        },
        870: {
            1: {
                "recipe_name": "《九宫飞星·蚀肌弹》参悟残页"
            }
        },
        871: {
            1: {
                "recipe_name": "《九宫飞星·蚀肌弹》参悟断篇"
            }
        },
        872: {
            1: {
                "recipe_name": "《九宫飞星·蚀肌弹》参悟绝章"
            }
        },
        873: {
            1: {
                "recipe_name": "《九宫飞星·蚀肌弹》秘诀残页"
            }
        },
        874: {
            1: {
                "recipe_name": "《九宫飞星·蚀肌弹》秘诀断篇"
            }
        },
        884: {
            1: {
                "recipe_name": "《九宫飞星·天绝地灭》参悟残页"
            }
        },
        885: {
            1: {
                "recipe_name": "《九宫飞星·天绝地灭》参悟断篇"
            }
        },
        886: {
            1: {
                "recipe_name": "《九宫飞星·天绝地灭》参悟绝章"
            }
        },
        1669: {
            1: {
                "recipe_name": "《九宫飞星·图穷匕见》参悟残页"
            }
        },
        1670: {
            1: {
                "recipe_name": "《九宫飞星·图穷匕见》参悟断篇"
            }
        },
        1671: {
            1: {
                "recipe_name": "《九宫飞星·图穷匕见》参悟绝章"
            }
        },
        1672: {
            1: {
                "recipe_name": "《九宫飞星·图穷匕见》秘诀残页"
            }
        },
        947: {
            1: {
                "recipe_name": "PVE6件套_机关"
            }
        },
        4120: {
            1: {
                "recipe_name": "PVE6件套_天罗"
            }
        },
        1532: {
            1: {
                "recipe_name": "90级天罗橙武属性1"
            }
        },
        1533: {
            1: {
                "recipe_name": "90级天罗橙武属性2"
            }
        },
        1146: {
            1: {
                "recipe_name": "小橙武_天罗"
            }
        },
        1978: {
            1: {
                "recipe_name": "小橙武_唐门_暴雨"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        2960: {
            1: {
                "recipe_name": "神机控制天绝地灭加伤害"
            }
        },
        2961: {
            1: {
                "recipe_name": "神机控制暗藏杀机加伤害"
            }
        },
        2962: {
            1: {
                "recipe_name": "神机控制诡面埋伏加伤害"
            }
        },
        1943: {
            1: {
                "recipe_name": "蚀肌弹增加25%伤害"
            }
        },
        919: {
            1: {
                "recipe_name": "绝伦逸群_浮光掠影消失时免控"
            },
            2: {
                "recipe_name": "绝伦逸群_浮光掠影消失时免控"
            }
        },
        1991: {
            1: {
                "recipe_name": "浮光掠影减CD"
            }
        },
        4925: {
            1: {
                "recipe_name": "重弩溅射范围加2尺"
            }
        },
        4926: {
            1: {
                "recipe_name": "强化重弩溅射范围增加2尺"
            }
        },
        2372: {
            1: {
                "recipe_name": "毒刹伤害30%"
            }
        },
        6115: {
            1: {
                "recipe_name": "暗藏击倒CD+7s"
            }
        },
        1223: {
            1: {
                "recipe_name": "鬼斧重弩范围加4尺"
            }
        },
        4960: {
            1: {
                "recipe_name": "惊鸿游龙减CD"
            }
        },
        2522: {
            1: {
                "recipe_name": "鬼斧神工降低45秒调息时间"
            }
        }
    },
    10242: {
        984: {
            1: {
                "recipe_name": "《日月净世·幽月轮》参悟残页"
            }
        },
        985: {
            1: {
                "recipe_name": "《日月净世·幽月轮》参悟断篇"
            }
        },
        988: {
            1: {
                "recipe_name": "《日月净世·幽月轮》秘诀残页"
            }
        },
        989: {
            1: {
                "recipe_name": "《日月净世·幽月轮》秘诀断篇"
            }
        },
        990: {
            1: {
                "recipe_name": "《日月净世·幽月轮》秘诀绝章"
            }
        },
        992: {
            1: {
                "recipe_name": "《日月净世·银月斩》秘诀残页"
            }
        },
        993: {
            1: {
                "recipe_name": "《日月净世·银月斩》秘诀断篇"
            }
        },
        994: {
            1: {
                "recipe_name": "《日月净世·银月斩》秘诀绝章"
            }
        },
        999: {
            1: {
                "recipe_name": "《日月净世·赤日轮》参悟残页"
            }
        },
        1000: {
            1: {
                "recipe_name": "《日月净世·赤日轮》参悟断篇"
            }
        },
        1001: {
            1: {
                "recipe_name": "《日月净世·赤日轮》参悟绝章"
            }
        },
        1004: {
            1: {
                "recipe_name": "《日月净世·赤日轮》秘诀残页"
            }
        },
        1005: {
            1: {
                "recipe_name": "《日月净世·赤日轮》秘诀断篇"
            }
        },
        1007: {
            1: {
                "recipe_name": "《日月净世·烈日斩》参悟残页"
            }
        },
        1008: {
            1: {
                "recipe_name": "《日月净世·烈日斩》参悟断篇"
            }
        },
        1009: {
            1: {
                "recipe_name": "《日月净世·烈日斩》参悟绝章"
            }
        },
        1010: {
            1: {
                "recipe_name": "《日月净世·烈日斩》秘诀残页"
            }
        },
        1011: {
            1: {
                "recipe_name": "《日月净世·烈日斩》秘诀断篇"
            }
        },
        1013: {
            1: {
                "recipe_name": "《日月净世·烈日斩》人偶图断篇"
            }
        },
        1014: {
            1: {
                "recipe_name": "《日月净世·净世破魔击》参悟残页"
            }
        },
        1015: {
            1: {
                "recipe_name": "《日月净世·净世破魔击》参悟断篇"
            }
        },
        1016: {
            1: {
                "recipe_name": "《日月净世·净世破魔击》参悟绝章"
            }
        },
        1017: {
            1: {
                "recipe_name": "《日月净世·净世破魔击》秘诀残页"
            }
        },
        1018: {
            1: {
                "recipe_name": "《日月净世·净世破魔击》秘诀断篇"
            }
        },
        1019: {
            1: {
                "recipe_name": "《日月净世·净世破魔击》秘诀绝章"
            }
        },
        1051: {
            1: {
                "recipe_name": "《御暗烬灭令·驱夜断愁》参悟残页"
            }
        },
        1052: {
            1: {
                "recipe_name": "《御暗烬灭令·驱夜断愁》参悟断篇"
            }
        },
        1053: {
            1: {
                "recipe_name": "《御暗烬灭令·驱夜断愁》参悟绝章"
            }
        },
        1054: {
            1: {
                "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀残页"
            }
        },
        1055: {
            1: {
                "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀断篇"
            }
        },
        1056: {
            1: {
                "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀绝章"
            }
        },
        1621: {
            1: {
                "recipe_name": "《日月净世·生死劫》参悟残页"
            }
        },
        1622: {
            1: {
                "recipe_name": "《日月净世·生死劫》参悟断篇"
            }
        },
        1623: {
            1: {
                "recipe_name": "《日月净世·生死劫》参悟绝章"
            }
        },
        948: {
            1: {
                "recipe_name": "PVP6件套_唐门"
            },
            2: {
                "recipe_name": "PVE6件套_焚影"
            },
            3: {
                "recipe_name": "PVP6件套_明教"
            },
            4: {
                "recipe_name": "PVE6件套_丐帮"
            }
        },
        1542: {
            1: {
                "recipe_name": "90级焚影橙武属性1"
            }
        },
        1543: {
            1: {
                "recipe_name": "90级焚影橙武属性2"
            }
        },
        1148: {
            1: {
                "recipe_name": "小橙武_焚影_月"
            }
        },
        1149: {
            1: {
                "recipe_name": "小橙武_焚影_日"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        5557: {
            1: {
                "recipe_name": "烈日buff_日轮加伤害"
            }
        },
        4545: {
            1: {
                "recipe_name": "生死劫必会心"
            }
        },
        4546: {
            1: {
                "recipe_name": "净世破魔击必会心"
            }
        },
        5366: {
            1: {
                "recipe_name": "日大加破魔伤害"
            }
        },
        5897: {
            1: {
                "recipe_name": "日破360度"
            }
        },
        5494: {
            1: {
                "recipe_name": "无往不复_月轮加伤害"
            }
        },
        5495: {
            1: {
                "recipe_name": "无往不复_日轮加伤害"
            }
        },
        5930: {
            1: {
                "recipe_name": "净体日斩加伤害"
            }
        },
        5931: {
            1: {
                "recipe_name": "净体月斩加伤害"
            }
        },
        3225: {
            1: {
                "recipe_name": "新明光_月终结加伤害_生死"
            }
        },
        3226: {
            1: {
                "recipe_name": "新明光_月终结加伤害_破魔"
            }
        },
        3227: {
            1: {
                "recipe_name": "新明光_月终结加伤害_影子"
            }
        },
        3222: {
            1: {
                "recipe_name": "新明光_日终结加伤害_生死"
            }
        },
        3223: {
            1: {
                "recipe_name": "新明光_日终结加伤害_破魔"
            }
        },
        3224: {
            1: {
                "recipe_name": "新明光_日终结加伤害_影子"
            }
        },
        5149: {
            1: {
                "recipe_name": "日斩伤害提高"
            }
        },
        5150: {
            1: {
                "recipe_name": "月斩伤害提高"
            }
        },
        5507: {
            1: {
                "recipe_name": "净体日斩减CD"
            }
        },
        5508: {
            1: {
                "recipe_name": "净体月斩减CD"
            }
        },
        3221: {
            1: {
                "recipe_name": "生死劫加cd和dot(已置空)"
            }
        },
        6100: {
            1: {
                "recipe_name": "怖畏暗刑换圣裁"
            }
        },
        5208: {
            1: {
                "recipe_name": "光明相减CD"
            }
        },
        5996: {
            1: {
                "recipe_name": "魂锁不可选中"
            }
        },
        5921: {
            1: {
                "recipe_name": "用晦而明_生死劫加CD"
            }
        },
        5652: {
            1: {
                "recipe_name": "大日破无视化"
            }
        },
        6096: {
            1: {
                "recipe_name": "贪魔体不充能"
            }
        }
    },
    10268: {
        1548: {
            1: {
                "recipe_name": "丐帮PVE套装属性亢龙"
            }
        },
        1540: {
            1: {
                "recipe_name": "90级丐帮橙武属性1"
            }
        },
        1541: {
            1: {
                "recipe_name": "90级丐帮橙武属性2"
            }
        },
        1980: {
            1: {
                "recipe_name": "小橙武_丐帮_蛟龙"
            }
        },
        1981: {
            1: {
                "recipe_name": "小橙武_丐帮_双龙取水"
            }
        },
        1982: {
            1: {
                "recipe_name": "小橙武_丐帮_龙游天地"
            }
        },
        1983: {
            1: {
                "recipe_name": "小橙武_丐帮_龙腾五岳"
            }
        },
        5844: {
            1: {
                "recipe_name": "笑醉狂蓄力时间变长"
            }
        },
        5661: {
            1: {
                "recipe_name": "亢龙心法加4尺"
            }
        },
        4872: {
            1: {
                "recipe_name": "亢龙子技能秘籍加范围"
            }
        },
        4340: {
            1: {
                "recipe_name": "驯致加伤害"
            }
        },
        5933: {
            1: {
                "recipe_name": "亢野减CD"
            }
        },
        5990: {
            1: {
                "recipe_name": "时乘六龙CD降低"
            }
        },
        1432: {
            1: {
                "recipe_name": "丐帮奇穴_亢龙加伤害"
            }
        },
        1433: {
            1: {
                "recipe_name": "丐帮奇穴_龙啸加伤害"
            }
        },
        6110: {
            1: {
                "recipe_name": "蛟龙翻江减CD"
            }
        },
        6111: {
            1: {
                "recipe_name": "蛟龙蓝耗降低"
            }
        },
        6112: {
            1: {
                "recipe_name": "双龙蓝耗降低"
            }
        },
        6113: {
            1: {
                "recipe_name": "龙游蓝耗降低"
            }
        },
        6114: {
            1: {
                "recipe_name": "龙腾蓝耗降低"
            }
        },
        5879: {
            1: {
                "recipe_name": "蜀犬伤害提高"
            }
        },
        4851: {
            1: {
                "recipe_name": "亢龙有悔加距离"
            }
        },
        5880: {
            1: {
                "recipe_name": "天下无狗加CD"
            }
        },
        5829: {
            1: {
                "recipe_name": "吐酒范围提高"
            }
        },
        1452: {
            1: {
                "recipe_name": "丐帮奇穴_烟雨行减CD"
            }
        },
        1462: {
            1: {
                "recipe_name": "烟雨行加跑速"
            }
        },
        5941: {
            1: {
                "recipe_name": "龙啸充能"
            }
        }
    },
    10390: {
        1830: {
            1: {
                "recipe_name": "《苍雪刀·劫刀》参悟残页"
            }
        },
        1831: {
            1: {
                "recipe_name": "《苍雪刀·劫刀》参悟断篇"
            }
        },
        1832: {
            1: {
                "recipe_name": "《苍雪刀·劫刀》参悟绝章"
            }
        },
        1833: {
            1: {
                "recipe_name": "《苍雪刀·劫刀》秘诀残页"
            }
        },
        1834: {
            1: {
                "recipe_name": "《苍雪刀·劫刀》秘诀断篇"
            }
        },
        1835: {
            1: {
                "recipe_name": "《苍雪刀·劫刀》秘诀绝章"
            }
        },
        1838: {
            1: {
                "recipe_name": "《苍雪刀·斩刀》参悟残页"
            }
        },
        1839: {
            1: {
                "recipe_name": "《苍雪刀·斩刀》参悟断篇"
            }
        },
        1840: {
            1: {
                "recipe_name": "《苍雪刀·斩刀》参悟绝章"
            }
        },
        1841: {
            1: {
                "recipe_name": "《苍雪刀·斩刀》秘诀残页"
            }
        },
        1842: {
            1: {
                "recipe_name": "《苍雪刀·斩刀》秘诀断篇"
            }
        },
        1843: {
            1: {
                "recipe_name": "《苍雪刀·斩刀》秘诀绝章"
            }
        },
        1846: {
            1: {
                "recipe_name": "《苍雪刀·绝刀》参悟残页"
            }
        },
        1847: {
            1: {
                "recipe_name": "《苍雪刀·绝刀》参悟断篇"
            }
        },
        1848: {
            1: {
                "recipe_name": "《苍雪刀·绝刀》秘诀残页"
            }
        },
        1849: {
            1: {
                "recipe_name": "《苍雪刀·绝刀》秘诀断篇"
            }
        },
        1852: {
            1: {
                "recipe_name": "《云城盾·盾压》参悟残页"
            }
        },
        1853: {
            1: {
                "recipe_name": "《云城盾·盾压》参悟断篇"
            }
        },
        1854: {
            1: {
                "recipe_name": "《云城盾·盾压》秘诀残页"
            }
        },
        1855: {
            1: {
                "recipe_name": "《云城盾·盾压》秘诀断篇"
            }
        },
        1860: {
            1: {
                "recipe_name": "《云城盾·盾刀》参悟残页"
            }
        },
        1861: {
            1: {
                "recipe_name": "《云城盾·盾刀》参悟断篇"
            }
        },
        1862: {
            1: {
                "recipe_name": "《云城盾·盾刀》参悟绝章"
            }
        },
        1863: {
            1: {
                "recipe_name": "《云城盾·盾刀》秘诀残页"
            }
        },
        1864: {
            1: {
                "recipe_name": "《云城盾·盾刀》秘诀断篇"
            }
        },
        1865: {
            1: {
                "recipe_name": "《云城盾·盾刀》秘诀绝章"
            }
        },
        1902: {
            1: {
                "recipe_name": "《破阵令·盾舞》参悟残页"
            }
        },
        1903: {
            1: {
                "recipe_name": "《破阵令·盾舞》参悟断篇"
            }
        },
        1904: {
            1: {
                "recipe_name": "《破阵令·盾舞》秘诀残页"
            }
        },
        1905: {
            1: {
                "recipe_name": "《破阵令·盾舞》秘诀断篇"
            }
        },
        1953: {
            1: {
                "recipe_name": "《破阵令·盾飞》参悟残页"
            }
        },
        1954: {
            1: {
                "recipe_name": "《破阵令·盾飞》参悟断篇"
            }
        },
        1955: {
            1: {
                "recipe_name": "《破阵令·盾飞》秘诀残页"
            }
        },
        1956: {
            1: {
                "recipe_name": "《破阵令·盾飞》秘诀断篇"
            }
        },
        1932: {
            1: {
                "recipe_name": "PVE4件套_分山绝刀"
            }
        },
        1933: {
            1: {
                "recipe_name": "PVE4件套_分山盾压"
            }
        },
        1934: {
            1: {
                "recipe_name": "小橙武_分山劲"
            }
        },
        1936: {
            1: {
                "recipe_name": "小橙武_分山劲2"
            }
        },
        1937: {
            1: {
                "recipe_name": "90橙武分山劲属性1"
            }
        },
        1938: {
            1: {
                "recipe_name": "90橙武分山劲属性2"
            }
        },
        1941: {
            1: {
                "recipe_name": "绝刀无消耗秘籍"
            }
        },
        2004: {
            1: {
                "recipe_name": "绝返绝刀伤害提高10%"
            }
        },
        2006: {
            1: {
                "recipe_name": "绝返绝刀伤害提高20%"
            }
        },
        2007: {
            1: {
                "recipe_name": "绝返绝刀伤害提高30%"
            }
        },
        2008: {
            1: {
                "recipe_name": "绝返绝刀伤害提高40%"
            }
        },
        4921: {
            1: {
                "recipe_name": "绝刀伤害提高72%"
            }
        },
        5725: {
            1: {
                "recipe_name": "怒气上限额外加成"
            }
        },
        5735: {
            1: {
                "recipe_name": "盾飞伤害提高"
            }
        },
        5977: {
            1: {
                "recipe_name": "新履刃加闪刀距离"
            }
        },
        5978: {
            1: {
                "recipe_name": "新履刃加劫刀距离"
            }
        },
        5364: {
            1: {
                "recipe_name": "盾击换cd"
            }
        },
        3234: {
            1: {
                "recipe_name": "盾舞加伤害"
            }
        },
        5745: {
            1: {
                "recipe_name": "绝刀无视防御"
            }
        },
        5746: {
            1: {
                "recipe_name": "绝刀破招无视防御"
            }
        },
        1899: {
            1: {
                "recipe_name": "盾击_增加充能时间"
            }
        },
        6016: {
            1: {
                "recipe_name": "新嗜血加绝刀双会"
            }
        },
        5562: {
            1: {
                "recipe_name": "登锋流血+100"
            }
        },
        5821: {
            1: {
                "recipe_name": "麾远_斩刀伤害提高20%"
            }
        },
        5804: {
            1: {
                "recipe_name": "盾猛伤害提高10%"
            }
        },
        5805: {
            1: {
                "recipe_name": "斩刀伤害提高10%"
            }
        },
        4935: {
            1: {
                "recipe_name": "绝刀距离提高2尺_吓魂"
            }
        },
        1925: {
            1: {
                "recipe_name": "照雪_盾飞充能次数增加2次"
            }
        },
        5123: {
            1: {
                "recipe_name": "血怒加cd"
            }
        },
        3239: {
            1: {
                "recipe_name": "连烽_盾飞相关"
            }
        }
    },
    10447: {
        2045: {
            1: {
                "recipe_name": "《音·宫_伤害》参悟残页"
            }
        },
        2046: {
            1: {
                "recipe_name": "《音·宫_伤害》参悟断篇"
            }
        },
        2047: {
            1: {
                "recipe_name": "《音·宫_伤害》秘诀残页"
            }
        },
        2048: {
            1: {
                "recipe_name": "《音·宫_伤害》秘诀断篇"
            }
        },
        2049: {
            1: {
                "recipe_name": "《音·宫_伤害》秘诀绝章"
            }
        },
        2058: {
            1: {
                "recipe_name": "《音·商_伤害》参悟残页"
            }
        },
        2059: {
            1: {
                "recipe_name": "《音·商_伤害》参悟断篇"
            }
        },
        2060: {
            1: {
                "recipe_name": "《音·商_伤害》参悟绝章"
            }
        },
        2063: {
            1: {
                "recipe_name": "《音·商_伤害》秘诀残页"
            }
        },
        2064: {
            1: {
                "recipe_name": "《音·商_伤害》秘诀断篇"
            }
        },
        2065: {
            1: {
                "recipe_name": "《音·商_伤害》秘诀绝章"
            }
        },
        2074: {
            1: {
                "recipe_name": "《音·徵_伤害》参悟残页"
            }
        },
        2075: {
            1: {
                "recipe_name": "《音·徵_伤害》参悟断篇"
            }
        },
        2076: {
            1: {
                "recipe_name": "《音·徵_伤害》秘诀残页"
            }
        },
        2077: {
            1: {
                "recipe_name": "《音·徵_伤害》秘诀断篇"
            }
        },
        2078: {
            1: {
                "recipe_name": "《音·徵_伤害》秘诀绝章"
            }
        },
        2089: {
            1: {
                "recipe_name": "《音·羽_伤害》参悟残页"
            }
        },
        2090: {
            1: {
                "recipe_name": "《音·羽_伤害》参悟断篇"
            }
        },
        2091: {
            1: {
                "recipe_name": "《音·羽_伤害》秘诀残页"
            }
        },
        2092: {
            1: {
                "recipe_name": "《音·羽_伤害》秘诀断篇"
            }
        },
        5909: {
            1: {
                "recipe_name": "长歌PVE套装剑徵伤害提高10%"
            }
        },
        2210: {
            1: {
                "recipe_name": "长歌PVE套装宫、徵伤害提高5%"
            }
        },
        2401: {
            1: {
                "recipe_name": "90级莫问输出属性1"
            }
        },
        2402: {
            1: {
                "recipe_name": "90级莫问输出属性2"
            }
        },
        2136: {
            1: {
                "recipe_name": "阳春白雪_宫_目标30%减防"
            }
        },
        2139: {
            1: {
                "recipe_name": "阳春白雪_徵_目标30%减防"
            }
        },
        2137: {
            1: {
                "recipe_name": "阳春白雪_宫_目标60%减防"
            }
        },
        2140: {
            1: {
                "recipe_name": "阳春白雪_徵_目标60%减防"
            }
        },
        2138: {
            1: {
                "recipe_name": "阳春白雪_宫_目标90%减防"
            }
        },
        2141: {
            1: {
                "recipe_name": "阳春白雪_徵_目标90%减防"
            }
        },
        2203: {
            1: {
                "recipe_name": "徵伤害提高20%"
            }
        },
        2204: {
            1: {
                "recipe_name": "徵伤害提高40%"
            }
        },
        2205: {
            1: {
                "recipe_name": "徵伤害提高60%"
            }
        },
        2206: {
            1: {
                "recipe_name": "徵伤害提高80%"
            }
        },
        2207: {
            1: {
                "recipe_name": "徵伤害提高100%"
            }
        },
        2208: {
            1: {
                "recipe_name": "徵伤害提高120%"
            }
        },
        2469: {
            1: {
                "recipe_name": "徵打音域目标伤害提高"
            }
        },
        5215: {
            1: {
                "recipe_name": "商加会心会效"
            }
        },
        5216: {
            1: {
                "recipe_name": "角加会心会效"
            }
        },
        5979: {
            1: {
                "recipe_name": "冻泉宫顺发加CD"
            }
        },
        5980: {
            1: {
                "recipe_name": "清绝影歌不占GCD"
            }
        },
        4881: {
            1: {
                "recipe_name": "剑徵两层充能"
            }
        },
        5915: {
            1: {
                "recipe_name": "爻辰剑徵无视防御"
            }
        },
        5496: {
            1: {
                "recipe_name": "响壑_徵增加跳数"
            }
        },
        5583: {
            1: {
                "recipe_name": "响壑徵加无视防御"
            }
        },
        2861: {
            1: {
                "recipe_name": "凝眉青霄飞羽减CD"
            }
        },
        5835: {
            1: {
                "recipe_name": "剑·羽伤害提高"
            }
        },
        5983: {
            1: {
                "recipe_name": "鹿鸣无视防御挂脚本"
            }
        },
        2193: {
            1: {
                "recipe_name": "豪情_徵立刻造成伤害"
            }
        },
        2195: {
            1: {
                "recipe_name": "豪情_移动徵立刻造成伤害"
            }
        },
        5833: {
            1: {
                "recipe_name": "剑·角伤害提高"
            }
        },
        2902: {
            1: {
                "recipe_name": "长清_莫问真·群徵"
            }
        },
        5985: {
            1: {
                "recipe_name": "长清徵10会心"
            }
        },
        5335: {
            1: {
                "recipe_name": "明心_音套路下不被打退_宫"
            }
        },
        5336: {
            1: {
                "recipe_name": "明心_音套路下不被打退_变宫"
            }
        },
        5337: {
            1: {
                "recipe_name": "明心_音套路下不被打退_徵"
            }
        },
        5338: {
            1: {
                "recipe_name": "明心_音套路下不被打退_变徵"
            }
        },
        6056: {
            1: {
                "recipe_name": "刻梦疏影横斜减CD"
            }
        },
        5334: {
            1: {
                "recipe_name": "青霄飞羽不被打退"
            }
        },
        5487: {
            1: {
                "recipe_name": "游羽青霄飞羽减读条"
            }
        }
    },
    10464: {
        4124: {
            1: {
                "recipe_name": "《殷雷腿·雷走风切》秘诀残页"
            }
        },
        4125: {
            1: {
                "recipe_name": "《殷雷腿·雷走风切》秘诀断篇"
            }
        },
        4126: {
            1: {
                "recipe_name": "《殷雷腿·雷走风切》秘诀绝章"
            }
        },
        4127: {
            1: {
                "recipe_name": "《殷雷腿·雷走风切》参悟残页"
            }
        },
        4128: {
            1: {
                "recipe_name": "《殷雷腿·雷走风切》参悟断篇"
            }
        },
        4129: {
            1: {
                "recipe_name": "《殷雷腿·雷走风切》参悟绝章"
            }
        },
        4140: {
            1: {
                "recipe_name": "《秀明尘身·项王击鼎》秘诀残页"
            }
        },
        4141: {
            1: {
                "recipe_name": "《秀明尘身·项王击鼎》秘诀断篇"
            }
        },
        4142: {
            1: {
                "recipe_name": "《秀明尘身·项王击鼎》秘诀绝章"
            }
        },
        4143: {
            1: {
                "recipe_name": "《秀明尘身·项王击鼎》参悟残页"
            }
        },
        4144: {
            1: {
                "recipe_name": "《秀明尘身·项王击鼎》参悟断篇"
            }
        },
        4145: {
            1: {
                "recipe_name": "《秀明尘身·项王击鼎》参悟绝章"
            }
        },
        4148: {
            1: {
                "recipe_name": "《秀明尘身·破釜沉舟》秘诀残页"
            }
        },
        4149: {
            1: {
                "recipe_name": "《秀明尘身·破釜沉舟》秘诀断篇"
            }
        },
        4150: {
            1: {
                "recipe_name": "《秀明尘身·破釜沉舟》秘诀绝章"
            }
        },
        4151: {
            1: {
                "recipe_name": "《秀明尘身·破釜沉舟》参悟残页"
            }
        },
        4152: {
            1: {
                "recipe_name": "《秀明尘身·破釜沉舟》参悟断篇"
            }
        },
        4153: {
            1: {
                "recipe_name": "《秀明尘身·破釜沉舟》参悟绝章"
            }
        },
        4156: {
            1: {
                "recipe_name": "《松烟竹雾·碎江天》秘诀残页"
            }
        },
        4157: {
            1: {
                "recipe_name": "《松烟竹雾·碎江天》秘诀断篇"
            }
        },
        4158: {
            1: {
                "recipe_name": "《松烟竹雾·碎江天》秘诀绝章"
            }
        },
        4159: {
            1: {
                "recipe_name": "《松烟竹雾·碎江天》参悟残页"
            }
        },
        4160: {
            1: {
                "recipe_name": "《松烟竹雾·碎江天》参悟断篇"
            }
        },
        4161: {
            1: {
                "recipe_name": "《松烟竹雾·碎江天》参悟绝章"
            }
        },
        4164: {
            1: {
                "recipe_name": "《雪絮金屏·刀啸风吟》秘诀残页"
            }
        },
        4165: {
            1: {
                "recipe_name": "《雪絮金屏·刀啸风吟》秘诀断篇"
            }
        },
        4166: {
            1: {
                "recipe_name": "《雪絮金屏·刀啸风吟》秘诀绝章"
            }
        },
        4167: {
            1: {
                "recipe_name": "《雪絮金屏·刀啸风吟》参悟断篇"
            }
        },
        4168: {
            1: {
                "recipe_name": "《雪絮金屏·刀啸风吟》参悟绝章"
            }
        },
        4172: {
            1: {
                "recipe_name": "《雪絮金屏·醉斩白蛇》秘诀残页"
            }
        },
        4173: {
            1: {
                "recipe_name": "《雪絮金屏·醉斩白蛇》秘诀断篇"
            }
        },
        4174: {
            1: {
                "recipe_name": "《雪絮金屏·醉斩白蛇》秘诀绝章"
            }
        },
        4175: {
            1: {
                "recipe_name": "《雪絮金屏·醉斩白蛇》参悟残页"
            }
        },
        4176: {
            1: {
                "recipe_name": "《雪絮金屏·醉斩白蛇》参悟断篇"
            }
        },
        4177: {
            1: {
                "recipe_name": "《雪絮金屏·醉斩白蛇》参悟绝章"
            }
        },
        4180: {
            1: {
                "recipe_name": "《松烟竹雾·擒龙六斩》秘诀残页"
            }
        },
        4181: {
            1: {
                "recipe_name": "《松烟竹雾·擒龙六斩》秘诀断篇"
            }
        },
        4182: {
            1: {
                "recipe_name": "《松烟竹雾·擒龙六斩》秘诀绝章"
            }
        },
        4183: {
            1: {
                "recipe_name": "《松烟竹雾·擒龙六斩》参悟残页"
            }
        },
        4184: {
            1: {
                "recipe_name": "《松烟竹雾·擒龙六斩》参悟断篇"
            }
        },
        4185: {
            1: {
                "recipe_name": "《松烟竹雾·擒龙六斩》参悟绝章"
            }
        },
        4371: {
            1: {
                "recipe_name": "《秀明尘身·上将军印》秘诀残页"
            }
        },
        4372: {
            1: {
                "recipe_name": "《秀明尘身·上将军印》秘诀断篇"
            }
        },
        4373: {
            1: {
                "recipe_name": "《秀明尘身·上将军印》秘诀绝章"
            }
        },
        4374: {
            1: {
                "recipe_name": "《秀明尘身·上将军印》参悟残页"
            }
        },
        4375: {
            1: {
                "recipe_name": "《秀明尘身·上将军印》参悟断篇"
            }
        },
        4376: {
            1: {
                "recipe_name": "《秀明尘身·上将军印》参悟绝章"
            }
        },
        4290: {
            1: {
                "recipe_name": "PVE6件套_霸刀_醉斩白蛇"
            }
        },
        4291: {
            1: {
                "recipe_name": "PVE6件套_霸刀_破釜沉舟"
            }
        },
        4294: {
            1: {
                "recipe_name": "90橙武霸刀属性1"
            }
        },
        4295: {
            1: {
                "recipe_name": "90橙武霸刀属性2"
            }
        },
        3350: {
            1: {
                "recipe_name": "爆体破釜沉舟+10能"
            }
        },
        4264: {
            1: {
                "recipe_name": "醉斩白蛇会心递增35%"
            }
        },
        4311: {
            1: {
                "recipe_name": "项王击鼎旋转伤害增加120%"
            }
        },
        2509: {
            1: {
                "recipe_name": "新砺锋醉斩加伤害"
            }
        },
        3265: {
            1: {
                "recipe_name": "走墙透支"
            }
        },
        2954: {
            1: {
                "recipe_name": "七刀降低目标数"
            }
        },
        5575: {
            1: {
                "recipe_name": "上将无视化"
            }
        },
        4230: {
            1: {
                "recipe_name": "吞楚_碎江天治疗转移"
            }
        },
        4231: {
            1: {
                "recipe_name": "斩纷_醉斩白蛇降低消耗造成首跳伤害"
            }
        },
        4298: {
            1: {
                "recipe_name": "上将军印增加伤害"
            }
        },
        2608: {
            1: {
                "recipe_name": "全角度破釜"
            }
        },
        6088: {
            1: {
                "recipe_name": "闹须弥充能"
            }
        },
        2510: {
            1: {
                "recipe_name": "新冥鼓项王"
            }
        },
        2511: {
            1: {
                "recipe_name": "新冥鼓破釜"
            }
        },
        2881: {
            1: {
                "recipe_name": "西楚悲歌减CD"
            }
        },
        2512: {
            1: {
                "recipe_name": "化蛟加醉斩CD跳数"
            }
        },
        2474: {
            1: {
                "recipe_name": "醉斩减读条"
            }
        },
        5626: {
            1: {
                "recipe_name": "项王一段gcd增加"
            }
        },
        5627: {
            1: {
                "recipe_name": "项王二段gcd增加"
            }
        },
        5628: {
            1: {
                "recipe_name": "项王三段gcd增加"
            }
        },
        5629: {
            1: {
                "recipe_name": "项王一段伤害提高+360°"
            }
        },
        5631: {
            1: {
                "recipe_name": "项王二段伤害提高+360°"
            }
        },
        5632: {
            1: {
                "recipe_name": "项王三段伤害提高+360°"
            }
        },
        5736: {
            1: {
                "recipe_name": "项王旋转伤害增加"
            }
        },
        6118: {
            1: {
                "recipe_name": "龙骧虎步加CD"
            }
        },
        6089: {
            1: {
                "recipe_name": "龙骧虎步调息增加"
            },
            2: {
                "recipe_name": "腿_龙骧虎步调息增加"
            }
        },
        4458: {
            1: {
                "recipe_name": "归酣_上将军印减消耗"
            }
        },
        4671: {
            1: {
                "recipe_name": "七刀减消耗"
            }
        },
        3351: {
            1: {
                "recipe_name": "临江上将军印归酣"
            }
        },
        5934: {
            1: {
                "recipe_name": "奇穴_归酣_虎步调息"
            }
        },
        5935: {
            1: {
                "recipe_name": "奇穴_归酣_大刀虎步调息"
            }
        },
        5903: {
            1: {
                "recipe_name": "奇穴_沧雪_增加消耗"
            }
        },
        3251: {
            1: {
                "recipe_name": "霸刀破釜沉舟不透支"
            }
        },
        3283: {
            1: {
                "recipe_name": "擒龙六斩距离变短"
            }
        },
        4319: {
            1: {
                "recipe_name": "闹须弥dot增加30%伤害"
            }
        },
        2833: {
            1: {
                "recipe_name": "强化闹须弥伤害提高"
            }
        },
        4339: {
            1: {
                "recipe_name": "楚河汉界变充能"
            },
            2: {
                "recipe_name": "楚河汉界变充能"
            }
        },
        4263: {
            1: {
                "recipe_name": "醉斩白蛇触发6秒调息"
            }
        }
    },
    10533: {
        2478: {
            1: {
                "recipe_name": "《九霄踏云步·浮游天地》秘诀残页"
            }
        },
        2479: {
            1: {
                "recipe_name": "《九霄踏云步·浮游天地》秘诀断篇"
            }
        },
        2480: {
            1: {
                "recipe_name": "《九霄踏云步·浮游天地》秘诀绝章"
            }
        },
        4714: {
            1: {
                "recipe_name": "《风起云扬诀·击水三千》秘诀残页"
            }
        },
        4715: {
            1: {
                "recipe_name": "《风起云扬诀·击水三千》秘诀断篇"
            }
        },
        4716: {
            1: {
                "recipe_name": "《风起云扬诀·击水三千》秘诀绝章"
            }
        },
        4717: {
            1: {
                "recipe_name": "《风起云扬诀·击水三千》参悟残页"
            }
        },
        4718: {
            1: {
                "recipe_name": "《风起云扬诀·击水三千》参悟断篇"
            }
        },
        4719: {
            1: {
                "recipe_name": "《风起云扬诀·击水三千》参悟绝章"
            }
        },
        4726: {
            1: {
                "recipe_name": "《风起云扬诀·木落雁归》秘诀残页"
            }
        },
        4727: {
            1: {
                "recipe_name": "《风起云扬诀·木落雁归》秘诀断篇"
            }
        },
        4728: {
            1: {
                "recipe_name": "《风起云扬诀·木落雁归》秘诀绝章"
            }
        },
        4729: {
            1: {
                "recipe_name": "《风起云扬诀·木落雁归》参悟残页"
            }
        },
        4730: {
            1: {
                "recipe_name": "《风起云扬诀·木落雁归》参悟断篇"
            }
        },
        4731: {
            1: {
                "recipe_name": "《风起云扬诀·木落雁归》参悟绝章"
            }
        },
        4739: {
            1: {
                "recipe_name": "《长空破云式·翼绝云天》秘诀残页"
            }
        },
        4740: {
            1: {
                "recipe_name": "《长空破云式·翼绝云天》秘诀断篇"
            }
        },
        4741: {
            1: {
                "recipe_name": "《长空破云式·翼绝云天》秘诀绝章"
            }
        },
        4742: {
            1: {
                "recipe_name": "《长空破云式·翼绝云天》参悟残页"
            }
        },
        4743: {
            1: {
                "recipe_name": "《长空破云式·翼绝云天》参悟断篇"
            }
        },
        4744: {
            1: {
                "recipe_name": "《长空破云式·翼绝云天》参悟绝章"
            }
        },
        4746: {
            1: {
                "recipe_name": "《长空破云式·振翅图南》秘诀残页"
            }
        },
        4747: {
            1: {
                "recipe_name": "《长空破云式·振翅图南》秘诀断篇"
            }
        },
        4748: {
            1: {
                "recipe_name": "《长空破云式·振翅图南》秘诀绝章"
            }
        },
        4749: {
            1: {
                "recipe_name": "《长空破云式·振翅图南》参悟残页"
            }
        },
        4750: {
            1: {
                "recipe_name": "《长空破云式·振翅图南》参悟断篇"
            }
        },
        4751: {
            1: {
                "recipe_name": "《长空破云式·振翅图南》参悟绝章"
            }
        },
        4792: {
            1: {
                "recipe_name": "《碧海缥缈掌·海运南冥》参悟残页"
            }
        },
        4793: {
            1: {
                "recipe_name": "《碧海缥缈掌·海运南冥》参悟断篇"
            }
        },
        4794: {
            1: {
                "recipe_name": "《碧海缥缈掌·海运南冥》参悟绝章"
            }
        },
        4795: {
            1: {
                "recipe_name": "《碧海缥缈掌·海运南冥》秘诀残页"
            }
        },
        4796: {
            1: {
                "recipe_name": "《碧海缥缈掌·海运南冥》秘诀断篇"
            }
        },
        4797: {
            1: {
                "recipe_name": "《碧海缥缈掌·海运南冥》秘诀绝章"
            }
        },
        4816: {
            1: {
                "recipe_name": "蓬莱PVE两件套木落雁归伤害提高10%"
            }
        },
        4817: {
            1: {
                "recipe_name": "蓬莱PVE两件套翼绝云天伤害提高10%"
            }
        },
        4818: {
            1: {
                "recipe_name": "蓬莱大橙武木落雁归伤害5%、"
            }
        },
        4819: {
            1: {
                "recipe_name": "蓬莱大橙武翼绝云天伤害5%"
            }
        },
        4820: {
            1: {
                "recipe_name": "蓬莱小橙武木落雁归会心提高5%"
            }
        },
        4821: {
            1: {
                "recipe_name": "蓬莱小橙武海运南冥会心提高5%"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        5992: {
            1: {
                "recipe_name": "风驰第1次强化风车伤害"
            }
        },
        5993: {
            1: {
                "recipe_name": "风驰第2次强化风车伤害"
            }
        },
        5994: {
            1: {
                "recipe_name": "风驰第3次强化风车伤害"
            }
        },
        4759: {
            1: {
                "recipe_name": "海运南冥伤害提高50%"
            }
        },
        4760: {
            1: {
                "recipe_name": "溟海御波伤害提高50%"
            }
        },
        4761: {
            1: {
                "recipe_name": "逐波灵游伤害提高50%"
            }
        },
        5666: {
            1: {
                "recipe_name": "新鸿轨溟海加伤害"
            }
        },
        5667: {
            1: {
                "recipe_name": "新鸿轨海运加伤害"
            }
        },
        5675: {
            1: {
                "recipe_name": "新鸿轨逐波加伤害"
            }
        },
        4789: {
            1: {
                "recipe_name": "海运南冥伤害提高10%"
            }
        },
        4790: {
            1: {
                "recipe_name": "溟海御波伤害提高10%"
            }
        },
        4791: {
            1: {
                "recipe_name": "逐波灵游伤害提高10%"
            }
        },
        5663: {
            1: {
                "recipe_name": "清源木落伤害提升"
            }
        },
        5664: {
            1: {
                "recipe_name": "清源木落伤害提升2"
            }
        },
        5665: {
            1: {
                "recipe_name": "清源木落伤害提升3"
            }
        },
        2485: {
            1: {
                "recipe_name": "溟海加8%"
            }
        },
        2488: {
            1: {
                "recipe_name": "海运8%"
            }
        },
        2491: {
            1: {
                "recipe_name": "逐波8%"
            }
        },
        2486: {
            1: {
                "recipe_name": "溟海加16%"
            }
        },
        2489: {
            1: {
                "recipe_name": "海运16%"
            }
        },
        2492: {
            1: {
                "recipe_name": "逐波16%"
            }
        },
        2487: {
            1: {
                "recipe_name": "溟海加24%"
            }
        },
        2490: {
            1: {
                "recipe_name": "海运24%"
            }
        },
        2493: {
            1: {
                "recipe_name": "逐波24%"
            }
        },
        5991: {
            1: {
                "recipe_name": "风驰减风车CD"
            }
        },
        4762: {
            1: {
                "recipe_name": "浮游天地带挑飞"
            }
        },
        4895: {
            1: {
                "recipe_name": "驭羽骋风减CD"
            }
        },
        4704: {
            1: {
                "recipe_name": "浮游天地充能"
            }
        },
        5995: {
            1: {
                "recipe_name": "乘龙加浮游cd"
            }
        },
        5237: {
            1: {
                "recipe_name": "振翅图南加范围"
            }
        },
        5904: {
            1: {
                "recipe_name": "振翅图南伤害提高50%"
            }
        },
        5238: {
            1: {
                "recipe_name": "逸尘步虚换CD"
            }
        },
        4724: {
            1: {
                "recipe_name": "木落雁归伤害提高30%"
            }
        },
        5230: {
            1: {
                "recipe_name": "振翅图南减CD加伤害"
            }
        },
        4725: {
            1: {
                "recipe_name": "溟海御波充能"
            }
        },
        5976: {
            1: {
                "recipe_name": "海运南冥充能"
            }
        }
    },
    10585: {
        4983: {
            1: {
                "recipe_name": "《断水刃·星垂平野》秘诀残页"
            }
        },
        4984: {
            1: {
                "recipe_name": "《断水刃·星垂平野》秘诀断篇"
            }
        },
        4985: {
            1: {
                "recipe_name": "《断水刃·星垂平野》秘诀绝章"
            }
        },
        4986: {
            1: {
                "recipe_name": "《断水刃·星垂平野》参悟残页"
            }
        },
        4987: {
            1: {
                "recipe_name": "《断水刃·星垂平野》参悟断篇"
            }
        },
        4988: {
            1: {
                "recipe_name": "《断水刃·星垂平野》参悟绝章"
            }
        },
        4994: {
            1: {
                "recipe_name": "《断水刃·金戈回澜》秘诀残页"
            }
        },
        4995: {
            1: {
                "recipe_name": "《断水刃·金戈回澜》秘诀断篇"
            }
        },
        4996: {
            1: {
                "recipe_name": "《断水刃·金戈回澜》参悟残页"
            }
        },
        4997: {
            1: {
                "recipe_name": "《断水刃·金戈回澜》参悟断篇"
            }
        },
        5001: {
            1: {
                "recipe_name": "《隐雷鞭·乱天狼》参悟残页"
            }
        },
        5002: {
            1: {
                "recipe_name": "《隐雷鞭·乱天狼》参悟断篇"
            }
        },
        5044: {
            1: {
                "recipe_name": "《隐雷鞭·乱天狼》秘诀残页"
            }
        },
        5045: {
            1: {
                "recipe_name": "《隐雷鞭·乱天狼》秘诀断篇"
            }
        },
        5004: {
            1: {
                "recipe_name": "《隐雷鞭·寂洪荒》参悟残页"
            }
        },
        5005: {
            1: {
                "recipe_name": "《隐雷鞭·寂洪荒》参悟断篇"
            }
        },
        5006: {
            1: {
                "recipe_name": "《隐雷鞭·寂洪荒》参悟绝章"
            }
        },
        6059: {
            1: {
                "recipe_name": "《隐雷鞭·寂洪荒》秘诀残页"
            }
        },
        5010: {
            1: {
                "recipe_name": "《隐雷鞭·斩无常》参悟残页"
            }
        },
        5011: {
            1: {
                "recipe_name": "《隐雷鞭·斩无常》参悟断篇"
            }
        },
        5046: {
            1: {
                "recipe_name": "《隐雷鞭·斩无常》秘诀残页"
            }
        },
        5047: {
            1: {
                "recipe_name": "《隐雷鞭·斩无常》秘诀断篇"
            }
        },
        5018: {
            1: {
                "recipe_name": "《冲云链·幽冥窥月》秘诀残页"
            }
        },
        5019: {
            1: {
                "recipe_name": "《冲云链·幽冥窥月》秘诀断篇"
            }
        },
        5050: {
            1: {
                "recipe_name": "《冲云链·幽冥窥月》参悟残页"
            }
        },
        5051: {
            1: {
                "recipe_name": "《冲云链·幽冥窥月》参悟断篇"
            }
        },
        5063: {
            1: {
                "recipe_name": "《隐雷鞭·隐风雷》秘诀残页"
            }
        },
        5064: {
            1: {
                "recipe_name": "《隐雷鞭·隐风雷》秘诀断篇"
            }
        },
        5065: {
            1: {
                "recipe_name": "《隐雷鞭·隐风雷》秘诀绝章"
            }
        },
        5069: {
            1: {
                "recipe_name": "《隐雷鞭·隐风雷》参悟残页"
            }
        },
        5070: {
            1: {
                "recipe_name": "《隐雷鞭·隐风雷》参悟断篇"
            }
        },
        5071: {
            1: {
                "recipe_name": "《隐雷鞭·隐风雷》参悟绝章"
            }
        },
        5037: {
            1: {
                "recipe_name": "凌雪阁PVE两件套_寂洪荒10%"
            }
        },
        5038: {
            1: {
                "recipe_name": "凌雪阁PVE两件套_金戈回澜10%"
            }
        },
        5091: {
            1: {
                "recipe_name": "凌雪阁大橙武星垂平野伤害5%"
            }
        },
        5092: {
            1: {
                "recipe_name": "凌雪阁大橙武寂洪荒伤害5%"
            }
        },
        5093: {
            1: {
                "recipe_name": "凌雪阁小橙武寂洪荒会心5%"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        4965: {
            1: {
                "recipe_name": "百节寂洪荒伤害提高10%"
            }
        },
        4966: {
            1: {
                "recipe_name": "百节乱天狼伤害提高10%"
            }
        },
        4967: {
            1: {
                "recipe_name": "百节隐风雷伤害提高10%"
            }
        },
        4968: {
            1: {
                "recipe_name": "百节斩无常伤害提高10%"
            }
        },
        4969: {
            1: {
                "recipe_name": "百节寂洪荒伤害提高20%"
            }
        },
        4970: {
            1: {
                "recipe_name": "百节乱天狼伤害提高20%"
            }
        },
        4971: {
            1: {
                "recipe_name": "百节隐风雷伤害提高20%"
            }
        },
        4972: {
            1: {
                "recipe_name": "百节斩无常伤害提高20%"
            }
        },
        4973: {
            1: {
                "recipe_name": "百节寂洪荒伤害提高30%"
            }
        },
        4974: {
            1: {
                "recipe_name": "百节乱天狼伤害提高30%"
            }
        },
        4975: {
            1: {
                "recipe_name": "百节隐风雷伤害提高30%"
            }
        },
        4976: {
            1: {
                "recipe_name": "百节斩无常伤害提高30%"
            }
        },
        4959: {
            1: {
                "recipe_name": "飞琼乱天狼伤害提高20%"
            }
        },
        2612: {
            1: {
                "recipe_name": "星垂平野伤害提高50%"
            }
        },
        3154: {
            1: {
                "recipe_name": "孤路斩10%"
            }
        },
        3155: {
            1: {
                "recipe_name": "孤路斩20%"
            }
        },
        3156: {
            1: {
                "recipe_name": "孤路斩30%"
            }
        },
        3157: {
            1: {
                "recipe_name": "孤路斩40%"
            }
        },
        3158: {
            1: {
                "recipe_name": "孤路斩50%"
            }
        },
        3159: {
            1: {
                "recipe_name": "孤路斩60%"
            }
        },
        3160: {
            1: {
                "recipe_name": "孤路斩70%"
            }
        },
        3161: {
            1: {
                "recipe_name": "孤路斩80%"
            }
        },
        3162: {
            1: {
                "recipe_name": "孤路斩90%"
            }
        },
        3163: {
            1: {
                "recipe_name": "孤路斩100%"
            }
        },
        2742: {
            1: {
                "recipe_name": "十方玄机渊秘-CD"
            }
        },
        4949: {
            1: {
                "recipe_name": "寂洪荒伤害提高10%"
            }
        },
        3036: {
            1: {
                "recipe_name": "长恨减铁马cd"
            }
        },
        5793: {
            1: {
                "recipe_name": "长恨加铁马伤害"
            }
        },
        6070: {
            1: {
                "recipe_name": "无间狱加CD"
            }
        },
        6071: {
            1: {
                "recipe_name": "无间狱一段加伤害"
            }
        },
        6072: {
            1: {
                "recipe_name": "无间狱2段加伤害"
            }
        },
        2496: {
            1: {
                "recipe_name": "沥血铁马加伤害"
            }
        },
        6069: {
            1: {
                "recipe_name": "血覆黄泉3层充能"
            }
        },
        5132: {
            1: {
                "recipe_name": "斩无常持续时间增加2秒"
            }
        },
        5911: {
            1: {
                "recipe_name": "血覆黄泉充能多一层"
            }
        },
        4952: {
            1: {
                "recipe_name": "乱天狼对静止目标"
            }
        },
        5100: {
            1: {
                "recipe_name": "金戈回澜会心会效提高10%"
            }
        },
        4950: {
            1: {
                "recipe_name": "寂洪荒读条"
            }
        },
        5566: {
            1: {
                "recipe_name": "隐鳞加链子距离"
            }
        },
        3181: {
            1: {
                "recipe_name": "斩无常减10秒cd"
            }
        }
    },
    10615: {
        5165: {
            1: {
                "recipe_name": "《九字诀·三星临》秘诀残页"
            }
        },
        5240: {
            1: {
                "recipe_name": "《九字诀·三星临》秘诀断篇"
            }
        },
        5241: {
            1: {
                "recipe_name": "《九字诀·三星临》参悟残页"
            }
        },
        5242: {
            1: {
                "recipe_name": "《九字诀·三星临》参悟断篇"
            }
        },
        5278: {
            1: {
                "recipe_name": "《九字诀·三星临》秘诀绝章"
            }
        },
        5279: {
            1: {
                "recipe_name": "《九字诀·三星临》参悟绝章"
            }
        },
        5244: {
            1: {
                "recipe_name": "《九字诀·兵主逆》秘诀断篇"
            }
        },
        5245: {
            1: {
                "recipe_name": "《九字诀·兵主逆》秘诀绝章"
            }
        },
        5246: {
            1: {
                "recipe_name": "《九字诀·兵主逆》参悟断篇"
            }
        },
        5247: {
            1: {
                "recipe_name": "《九字诀·兵主逆》参悟绝章"
            }
        },
        5280: {
            1: {
                "recipe_name": "《九字诀·兵主逆》参悟残页"
            }
        },
        5250: {
            1: {
                "recipe_name": "《九字诀·天斗旋》秘诀残页"
            }
        },
        5251: {
            1: {
                "recipe_name": "《九字诀·天斗旋》秘诀断篇"
            }
        },
        5252: {
            1: {
                "recipe_name": "《九字诀·天斗旋》秘诀绝章"
            }
        },
        5299: {
            1: {
                "recipe_name": "《九字诀·天斗旋》参悟残页"
            }
        },
        5300: {
            1: {
                "recipe_name": "《九字诀·天斗旋》参悟断篇"
            }
        },
        5301: {
            1: {
                "recipe_name": "《九字诀·天斗旋》参悟绝章"
            }
        },
        5272: {
            1: {
                "recipe_name": "《奇门·鬼星开穴》秘诀断篇"
            }
        },
        5273: {
            1: {
                "recipe_name": "《奇门·鬼星开穴》秘诀绝章"
            }
        },
        5274: {
            1: {
                "recipe_name": "《奇门·鬼星开穴》参悟断篇"
            }
        },
        5275: {
            1: {
                "recipe_name": "《奇门·鬼星开穴》参悟绝章"
            }
        },
        5321: {
            1: {
                "recipe_name": "衍天宗PVE套装效果1"
            }
        },
        5322: {
            1: {
                "recipe_name": "衍天宗PVE套装效果2"
            }
        },
        5325: {
            1: {
                "recipe_name": "衍天宗大橙武属性加成1"
            }
        },
        5326: {
            1: {
                "recipe_name": "衍天宗大橙武属性加成2"
            }
        },
        5327: {
            1: {
                "recipe_name": "衍天宗小CW会心加成"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        5302: {
            1: {
                "recipe_name": "斗多层充能"
            }
        },
        6073: {
            1: {
                "recipe_name": "纵横三才调息提高"
            }
        },
        5870: {
            1: {
                "recipe_name": "奇穴_擎羊_无视化劲"
            }
        },
        2631: {
            1: {
                "recipe_name": "起卦调息降低"
            }
        },
        5332: {
            1: {
                "recipe_name": "兵主逆免打退"
            }
        },
        6074: {
            1: {
                "recipe_name": "顺祝兵主逆伤害提高10%"
            }
        },
        5179: {
            1: {
                "recipe_name": "山艮卦象_临伤害提高"
            }
        },
        5180: {
            1: {
                "recipe_name": "山艮卦象_兵伤害提高"
            }
        },
        5181: {
            1: {
                "recipe_name": "山艮卦象_斗伤害提高"
            }
        },
        2432: {
            1: {
                "recipe_name": "鬼星开穴层数提高"
            }
        },
        5200: {
            1: {
                "recipe_name": "变卦充能"
            }
        },
        5825: {
            1: {
                "recipe_name": "奇穴_焚如_被控增伤"
            }
        },
        5210: {
            1: {
                "recipe_name": "放灯距离提高"
            }
        },
        2433: {
            1: {
                "recipe_name": "纵横三才距离提高"
            }
        }
    },
    10627: {
        2636: {
            1: {
                "recipe_name": "《行忌制方·商陆缀寒》秘诀残页"
            }
        },
        2637: {
            1: {
                "recipe_name": "《行忌制方·商陆缀寒》秘诀断篇"
            }
        },
        2638: {
            1: {
                "recipe_name": "《行忌制方·商陆缀寒》参悟残页"
            }
        },
        2639: {
            1: {
                "recipe_name": "《行忌制方·商陆缀寒》参悟断篇"
            }
        },
        2643: {
            1: {
                "recipe_name": "《行忌制方·钩吻断肠》秘诀残页"
            }
        },
        2644: {
            1: {
                "recipe_name": "《行忌制方·钩吻断肠》秘诀断篇"
            }
        },
        2645: {
            1: {
                "recipe_name": "《行忌制方·钩吻断肠》秘诀绝章"
            }
        },
        2646: {
            1: {
                "recipe_name": "《行忌制方·钩吻断肠》参悟残页"
            }
        },
        2647: {
            1: {
                "recipe_name": "《行忌制方·钩吻断肠》参悟断篇"
            }
        },
        2650: {
            1: {
                "recipe_name": "《行忌制方·川乌射罔》秘诀残页"
            }
        },
        2651: {
            1: {
                "recipe_name": "《行忌制方·川乌射罔》秘诀断篇"
            }
        },
        2652: {
            1: {
                "recipe_name": "《行忌制方·川乌射罔》参悟残页"
            }
        },
        2653: {
            1: {
                "recipe_name": "《行忌制方·川乌射罔》参悟断篇"
            }
        },
        2659: {
            1: {
                "recipe_name": "《行忌制方·且待时休》参悟残页"
            }
        },
        2660: {
            1: {
                "recipe_name": "《行忌制方·且待时休》参悟断篇"
            }
        },
        2692: {
            1: {
                "recipe_name": "《凌波飞叶令·银光照雪》秘诀残页"
            }
        },
        2693: {
            1: {
                "recipe_name": "《凌波飞叶令·银光照雪》秘诀断篇"
            }
        },
        2694: {
            1: {
                "recipe_name": "《凌波飞叶令·银光照雪》参悟残页"
            }
        },
        2695: {
            1: {
                "recipe_name": "《凌波飞叶令·银光照雪》参悟断篇"
            }
        },
        2839: {
            1: {
                "recipe_name": "北天药宗无方PVE两件套_奚毒10%"
            }
        },
        2840: {
            1: {
                "recipe_name": "北天药宗无方PVE两件套_商陆10%"
            }
        },
        2842: {
            1: {
                "recipe_name": "北天药宗无方大橙武奚毒伤害5%"
            }
        },
        2843: {
            1: {
                "recipe_name": "北天药宗无方大橙武钩吻伤害5%"
            }
        },
        2841: {
            1: {
                "recipe_name": "北天药宗无方小CW_奚毒会心5%"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        2731: {
            1: {
                "recipe_name": "苍棘缚地加伤害"
            }
        },
        2732: {
            1: {
                "recipe_name": "青川濯莲加伤害"
            }
        },
        2764: {
            1: {
                "recipe_name": "灵荆加伤害"
            }
        },
        2579: {
            1: {
                "recipe_name": "炮阳中和伤害提高30%"
            }
        },
        2858: {
            1: {
                "recipe_name": "荆障加伤害"
            }
        },
        2767: {
            1: {
                "recipe_name": "含锋破月6%"
            }
        },
        2775: {
            1: {
                "recipe_name": "飞叶满襟6%"
            }
        },
        2768: {
            1: {
                "recipe_name": "含锋破月12%"
            }
        },
        2776: {
            1: {
                "recipe_name": "飞叶满襟12%"
            }
        },
        2769: {
            1: {
                "recipe_name": "含锋破月18%"
            }
        },
        2777: {
            1: {
                "recipe_name": "飞叶满襟18%"
            }
        },
        2770: {
            1: {
                "recipe_name": "含锋破月24%"
            }
        },
        2778: {
            1: {
                "recipe_name": "飞叶满襟24%"
            }
        },
        2771: {
            1: {
                "recipe_name": "含锋破月30%"
            }
        },
        2779: {
            1: {
                "recipe_name": "飞叶满襟30%"
            }
        },
        2772: {
            1: {
                "recipe_name": "含锋破月36%"
            }
        },
        2780: {
            1: {
                "recipe_name": "飞叶满襟36%"
            }
        },
        2773: {
            1: {
                "recipe_name": "含锋破月42%"
            }
        },
        2781: {
            1: {
                "recipe_name": "飞叶满襟42%"
            }
        },
        2774: {
            1: {
                "recipe_name": "含锋破月48%"
            }
        },
        2782: {
            1: {
                "recipe_name": "飞叶满襟48%"
            }
        },
        2573: {
            1: {
                "recipe_name": "滞眠且待时休增伤10%"
            }
        },
        2574: {
            1: {
                "recipe_name": "滞眠且待时休增伤20%"
            }
        },
        2575: {
            1: {
                "recipe_name": "滞眠且待时休增伤30%"
            }
        },
        2835: {
            1: {
                "recipe_name": "滞眠且待时休增伤40%"
            }
        },
        2549: {
            1: {
                "recipe_name": "鸩羽奚毒射罔10会心会效"
            }
        },
        2560: {
            1: {
                "recipe_name": "断泽惊鸿掠水不占GCD"
            }
        },
        5458: {
            1: {
                "recipe_name": "断泽+肃羽的惊鸿掠水无gcd"
            }
        },
        5478: {
            1: {
                "recipe_name": "断泽惊鸿掠水减cd"
            }
        },
        5392: {
            1: {
                "recipe_name": "渌波紫叶不占gcd"
            }
        },
        2889: {
            1: {
                "recipe_name": "含锋破月35%"
            }
        },
        2890: {
            1: {
                "recipe_name": "飞叶满襟35%"
            }
        },
        5773: {
            1: {
                "recipe_name": "紫伏紫叶沉疴减cd"
            }
        },
        2570: {
            1: {
                "recipe_name": "熟地商陆其根减读条"
            }
        },
        2555: {
            1: {
                "recipe_name": "岚因沾衣未妨群攻"
            }
        },
        2856: {
            1: {
                "recipe_name": "岚因沾衣中和加人数"
            }
        },
        5905: {
            1: {
                "recipe_name": "逆势银光照雪-3s"
            }
        },
        2562: {
            1: {
                "recipe_name": "触融银光照雪加CD"
            }
        }
    },
    10756: {
        5394: {
            1: {
                "recipe_name": "《上弦星流术·劲风簇》秘诀残页"
            }
        },
        5407: {
            1: {
                "recipe_name": "《上弦星流术·劲风簇》秘诀断篇"
            }
        },
        5408: {
            1: {
                "recipe_name": "《上弦星流术·劲风簇》参悟残页"
            }
        },
        5409: {
            1: {
                "recipe_name": "《上弦星流术·劲风簇》参悟断篇"
            }
        },
        5414: {
            1: {
                "recipe_name": "《上弦星流术·饮羽簇》秘诀残页"
            }
        },
        5415: {
            1: {
                "recipe_name": "《上弦星流术·饮羽簇》秘诀断篇"
            }
        },
        5416: {
            1: {
                "recipe_name": "《上弦星流术·饮羽簇》参悟残页"
            }
        },
        5417: {
            1: {
                "recipe_name": "《上弦星流术·饮羽簇》参悟断篇"
            }
        },
        5467: {
            1: {
                "recipe_name": "《上弦星流术·饮羽簇》人偶图绝章"
            }
        },
        5438: {
            1: {
                "recipe_name": "万灵山庄pve四件套"
            }
        },
        5461: {
            1: {
                "recipe_name": "万灵山庄大CW属性加成1"
            }
        },
        5462: {
            1: {
                "recipe_name": "万灵山庄大CW属性加成2"
            }
        },
        5463: {
            1: {
                "recipe_name": "万灵山庄小CW属性加成"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        716: {
            1: {
                "recipe_name": "匣中_凌太虚效果1"
            },
            2: {
                "recipe_name": "匣中_凌太虚效果2"
            }
        },
        717: {
            1: {
                "recipe_name": "匣中_碎星辰效果1"
            },
            2: {
                "recipe_name": "匣中_碎星辰效果2"
            }
        },
        5755: {
            1: {
                "recipe_name": "万灵CW劲风伤害增加"
            }
        },
        5377: {
            1: {
                "recipe_name": "祝灵_加归平野伤害"
            }
        },
        5384: {
            1: {
                "recipe_name": "劲风簇100%伤害"
            }
        },
        5379: {
            1: {
                "recipe_name": "朱厌_加调息"
            }
        },
        5376: {
            1: {
                "recipe_name": "祝灵_换充能cd"
            }
        },
        5500: {
            1: {
                "recipe_name": "兴游_增加调息时间"
            }
        },
        5422: {
            1: {
                "recipe_name": "贯侯_标鹄伤害增加"
            }
        },
        6085: {
            1: {
                "recipe_name": "聚式摧霆三层充能"
            }
        },
        5748: {
            1: {
                "recipe_name": "佩弦-饮雨簇无视防御"
            }
        },
        6084: {
            1: {
                "recipe_name": "极偕_加归平野伤害"
            }
        },
        5378: {
            1: {
                "recipe_name": "腾驾_两层充能替换"
            }
        },
        5397: {
            1: {
                "recipe_name": "领胡降低调息时间"
            }
        }
    },
    10698: {
        2992: {
            1: {
                "recipe_name": "《流云势法·纷绞势》秘诀断篇"
            }
        },
        3040: {
            1: {
                "recipe_name": "《流云势法·纷绞势》秘诀绝章"
            }
        },
        3041: {
            1: {
                "recipe_name": "《流云势法·纷绞势》参悟断篇"
            }
        },
        3042: {
            1: {
                "recipe_name": "《流云势法·纷绞势》参悟绝章"
            }
        },
        3111: {
            1: {
                "recipe_name": "《流云势法·纷绞势》秘诀残页"
            }
        },
        3112: {
            1: {
                "recipe_name": "《流云势法·纷绞势》参悟残页"
            }
        },
        3043: {
            1: {
                "recipe_name": "《流云势法·顾应势》秘诀断篇"
            }
        },
        3044: {
            1: {
                "recipe_name": "《流云势法·顾应势》秘诀绝章"
            }
        },
        3045: {
            1: {
                "recipe_name": "《流云势法·顾应势》参悟断篇"
            }
        },
        3046: {
            1: {
                "recipe_name": "《流云势法·顾应势》参悟绝章"
            }
        },
        3047: {
            1: {
                "recipe_name": "《流云势法·起落势》秘诀断篇"
            }
        },
        3048: {
            1: {
                "recipe_name": "《流云势法·起落势》秘诀绝章"
            }
        },
        3049: {
            1: {
                "recipe_name": "《流云势法·起落势》参悟断篇"
            }
        },
        3050: {
            1: {
                "recipe_name": "《流云势力·起落势》参悟绝章"
            }
        },
        3051: {
            1: {
                "recipe_name": "《破浪三式·沧浪三叠》秘诀断篇"
            }
        },
        3052: {
            1: {
                "recipe_name": "《破浪三式·沧浪三叠》秘诀绝章"
            }
        },
        3053: {
            1: {
                "recipe_name": "《破浪三式·沧浪三叠》参悟断篇"
            }
        },
        3054: {
            1: {
                "recipe_name": "《破浪三式·沧浪三叠》参悟绝章"
            }
        },
        3127: {
            1: {
                "recipe_name": "《破浪三式·沧浪三叠》秘诀残页"
            }
        },
        3128: {
            1: {
                "recipe_name": "《破浪三式·沧浪三叠》参悟残页"
            }
        },
        3055: {
            1: {
                "recipe_name": "《破浪三式·横云断浪》秘诀断篇"
            }
        },
        3056: {
            1: {
                "recipe_name": "《破浪三式·横云断浪》秘诀绝章"
            }
        },
        3057: {
            1: {
                "recipe_name": "《破浪三式·横云断浪》参悟断篇"
            }
        },
        3058: {
            1: {
                "recipe_name": "《破浪三式·横云断浪》参悟绝章"
            }
        },
        3059: {
            1: {
                "recipe_name": "《破浪三式·孤锋破浪》秘诀断篇"
            }
        },
        3060: {
            1: {
                "recipe_name": "《破浪三式·孤锋破浪》秘诀绝章"
            }
        },
        3061: {
            1: {
                "recipe_name": "《破浪三式·孤锋破浪》参悟断篇"
            }
        },
        3062: {
            1: {
                "recipe_name": "《破浪三式·孤锋破浪》参悟绝章"
            }
        },
        3063: {
            1: {
                "recipe_name": "《骤雨劲·留客雨》秘诀断篇"
            }
        },
        3064: {
            1: {
                "recipe_name": "《骤雨劲·留客雨》秘诀绝章"
            }
        },
        3065: {
            1: {
                "recipe_name": "《骤雨劲·留客雨》参悟断篇"
            }
        },
        3066: {
            1: {
                "recipe_name": "《骤雨劲·留客雨》参悟绝章"
            }
        },
        3141: {
            1: {
                "recipe_name": "《骤雨劲·留客雨》秘诀残页"
            }
        },
        3142: {
            1: {
                "recipe_name": "《骤雨劲·留客雨》参悟残页"
            }
        },
        3133: {
            1: {
                "recipe_name": "《骤雨劲·触石雨》参悟残页"
            }
        },
        3134: {
            1: {
                "recipe_name": "《骤雨劲·触石雨》参悟绝章"
            }
        },
        3137: {
            1: {
                "recipe_name": "《流云势法·疾电势》参悟残页"
            }
        },
        3138: {
            1: {
                "recipe_name": "《流云势法·疾电势》参悟断篇"
            }
        },
        3139: {
            1: {
                "recipe_name": "《流云势法·疾电势》秘诀残页"
            }
        },
        3140: {
            1: {
                "recipe_name": "《流云势法·疾电势》秘诀断篇"
            }
        },
        3188: {
            1: {
                "recipe_name": "刀宗PVE套装效果1"
            }
        },
        3186: {
            1: {
                "recipe_name": "刀宗大橙武属性加成1"
            }
        },
        3187: {
            1: {
                "recipe_name": "刀宗大橙武属性加成2"
            }
        },
        3185: {
            1: {
                "recipe_name": "刀宗小CW会心加成"
            }
        },
        5754: {
            1: {
                "recipe_name": "橙武孤锋增伤"
            }
        },
        3014: {
            1: {
                "recipe_name": "起落势伤害提高15%"
            }
        },
        3016: {
            1: {
                "recipe_name": "起落势伤害提高30%"
            }
        },
        3017: {
            1: {
                "recipe_name": "起落势伤害提高45%"
            }
        },
        3018: {
            1: {
                "recipe_name": "起落势伤害提高60%"
            }
        },
        3028: {
            1: {
                "recipe_name": "起落势伤害提高75%"
            }
        },
        3029: {
            1: {
                "recipe_name": "起落势伤害提高90%"
            }
        },
        3219: {
            1: {
                "recipe_name": "洗兵雨距离提高"
            }
        },
        6032: {
            1: {
                "recipe_name": "小凝云势"
            }
        },
        3032: {
            1: {
                "recipe_name": "横云断浪流血提高跳数"
            }
        },
        3035: {
            1: {
                "recipe_name": "门派轻功充能"
            }
        },
        3025: {
            1: {
                "recipe_name": "沧浪三叠范围目标提高"
            }
        },
        3106: {
            1: {
                "recipe_name": "孤风破浪范围提高"
            }
        },
        3107: {
            1: {
                "recipe_name": "横云断浪范围提高"
            }
        },
        5584: {
            1: {
                "recipe_name": "孤锋8%"
            }
        },
        5585: {
            1: {
                "recipe_name": "沧浪8%"
            }
        },
        5586: {
            1: {
                "recipe_name": "横云8%"
            }
        },
        5943: {
            1: {
                "recipe_name": "奇穴_袭伐_增加停云调息"
            }
        },
        5944: {
            1: {
                "recipe_name": "奇穴_袭伐_增加横云调息"
            }
        },
        3034: {
            1: {
                "recipe_name": "凝神势破锋AOE回能"
            }
        }
    },
    10786: {
        5576: {
            1: {
                "recipe_name": "《一阳指·断脉》秘诀残页"
            }
        },
        5681: {
            1: {
                "recipe_name": "《一阳指·断脉》秘诀断篇"
            }
        },
        5682: {
            1: {
                "recipe_name": "《一阳指·断脉》秘诀绝章"
            }
        },
        5683: {
            1: {
                "recipe_name": "《一阳指·断脉》参悟残页"
            }
        },
        5684: {
            1: {
                "recipe_name": "《一阳指·断脉》参悟断篇"
            }
        },
        5685: {
            1: {
                "recipe_name": "《一阳指·断脉》参悟绝章"
            }
        },
        5688: {
            1: {
                "recipe_name": "《一阳指·截阳》秘诀残页"
            }
        },
        5689: {
            1: {
                "recipe_name": "《一阳指·截阳》秘诀断篇"
            }
        },
        5690: {
            1: {
                "recipe_name": "《一阳指·截阳》秘诀绝章"
            }
        },
        5691: {
            1: {
                "recipe_name": "《一阳指·截阳》参悟残页"
            }
        },
        5692: {
            1: {
                "recipe_name": "《一阳指·截阳》参悟断篇"
            }
        },
        5693: {
            1: {
                "recipe_name": "《一阳指·截阳》参悟绝章"
            }
        },
        5696: {
            1: {
                "recipe_name": "《一阳指·破穴》秘诀残页"
            }
        },
        5697: {
            1: {
                "recipe_name": "《一阳指·破穴》秘诀断篇"
            }
        },
        5698: {
            1: {
                "recipe_name": "《一阳指·破穴》参悟残页"
            }
        },
        5699: {
            1: {
                "recipe_name": "《一阳指·破穴》参悟断篇"
            }
        },
        5702: {
            1: {
                "recipe_name": "《一阳指·破穴》秘诀绝章"
            }
        },
        5703: {
            1: {
                "recipe_name": "《一阳指·破穴》参悟绝章"
            }
        },
        5704: {
            1: {
                "recipe_name": "《一阳指·引窍》秘诀残页"
            }
        },
        5705: {
            1: {
                "recipe_name": "《一阳指·引窍》秘诀断篇"
            }
        },
        5706: {
            1: {
                "recipe_name": "《一阳指·引窍》参悟残页"
            }
        },
        5707: {
            1: {
                "recipe_name": "《一阳指·引窍》参悟断篇"
            }
        },
        5712: {
            1: {
                "recipe_name": "《聘风令·抟风令》参悟残页"
            }
        },
        5713: {
            1: {
                "recipe_name": "《聘风令·抟风令》参悟断篇"
            }
        },
        5714: {
            1: {
                "recipe_name": "《聘风令·劈风令》秘诀残页"
            }
        },
        5715: {
            1: {
                "recipe_name": "《聘风令·劈风令》秘诀断篇"
            }
        },
        5716: {
            1: {
                "recipe_name": "《聘风令·劈风令》参悟残页"
            }
        },
        5717: {
            1: {
                "recipe_name": "《聘风令·劈风令》参悟断篇"
            }
        },
        5737: {
            1: {
                "recipe_name": "段氏pve四件套"
            }
        },
        5749: {
            1: {
                "recipe_name": "段氏大CW属性加成1"
            }
        },
        5750: {
            1: {
                "recipe_name": "段氏大CW属性加成2"
            }
        },
        5751: {
            1: {
                "recipe_name": "段氏小CW属性加成"
            }
        },
        1711: {
            1: {
                "recipe_name": "普通攻击提高伤害"
            }
        },
        5620: {
            1: {
                "recipe_name": "骤风共振伤害增加"
            }
        },
        5635: {
            1: {
                "recipe_name": "出岫降风流云散cd"
            }
        },
        5845: {
            1: {
                "recipe_name": "劈风令弹射降伤害"
            }
        },
        5640: {
            1: {
                "recipe_name": "茫渺静止增伤"
            }
        },
        5641: {
            1: {
                "recipe_name": "悬枢两层充能"
            }
        },
        5619: {
            1: {
                "recipe_name": "抟风令调息降低伤害增加"
            }
        },
        5621: {
            1: {
                "recipe_name": "劈风令三层充能"
            }
        },
        5959: {
            1: {
                "recipe_name": "风萦劈风令三层充能"
            }
        },
        5617: {
            1: {
                "recipe_name": "引窍增幅增加"
            }
        }
    },
    10821: {
        6121: {
            1: {
                "recipe_name": "《百傀叩梦·障幕虚影》参悟残页"
            }
        },
        6122: {
            1: {
                "recipe_name": "《百傀叩梦·障幕虚影》参悟断篇"
            }
        },
        6128: {
            1: {
                "recipe_name": "《织心谣·缚影》秘诀残页"
            }
        },
        6129: {
            1: {
                "recipe_name": "《织心谣·缚影》秘诀断篇"
            }
        },
        6130: {
            1: {
                "recipe_name": "《织心谣·缚影》参悟残页"
            }
        },
        6131: {
            1: {
                "recipe_name": "《织心谣·缚影》参悟断篇"
            }
        },
        6134: {
            1: {
                "recipe_name": "《织心谣·挑丝》秘诀残页"
            }
        },
        6135: {
            1: {
                "recipe_name": "《织心谣·挑丝》参悟残页"
            }
        },
        6136: {
            1: {
                "recipe_name": "《织心谣·挑丝》参悟断篇"
            }
        },
        6138: {
            1: {
                "recipe_name": "《傀儡调·生地狱》秘诀残页"
            }
        },
        6139: {
            1: {
                "recipe_name": "《傀儡调·生地狱》秘诀断篇"
            }
        },
        6140: {
            1: {
                "recipe_name": "《傀儡调·生地狱》参悟残页"
            }
        },
        6141: {
            1: {
                "recipe_name": "《傀儡调·生地狱》参悟断篇"
            }
        },
        6143: {
            1: {
                "recipe_name": "《傀儡调·千里急》秘诀残页"
            }
        },
        6144: {
            1: {
                "recipe_name": "《傀儡调·千里急》秘诀断篇"
            }
        },
        6145: {
            1: {
                "recipe_name": "《傀儡调·千里急》参悟残页"
            }
        },
        6146: {
            1: {
                "recipe_name": "《傀儡调·千里急》参悟断篇"
            }
        },
        6002: {
            1: {
                "recipe_name": "切成傀儡增伤_千里急"
            }
        },
        6004: {
            1: {
                "recipe_name": "切成傀儡增伤_四边静"
            }
        },
        6005: {
            1: {
                "recipe_name": "切成傀儡增伤_生地狱"
            }
        },
        6052: {
            1: {
                "recipe_name": "奇穴傀儡冲刺后千里急增伤"
            }
        },
        6053: {
            1: {
                "recipe_name": "奇穴傀儡冲刺后生地狱增伤"
            }
        },
        6054: {
            1: {
                "recipe_name": "奇穴傀儡冲刺后四边静增伤"
            }
        },
        6066: {
            1: {
                "recipe_name": "非奇穴傀儡冲刺后千里急增伤"
            }
        },
        6067: {
            1: {
                "recipe_name": "非奇穴傀儡冲刺后生地狱增伤"
            }
        },
        6068: {
            1: {
                "recipe_name": "非奇穴傀儡冲刺后四边静增伤"
            }
        },
        6057: {
            1: {
                "recipe_name": "缚影增伤且无限缚影"
            }
        },
        6006: {
            1: {
                "recipe_name": "傀儡速切奇穴改cd"
            }
        },
        6007: {
            1: {
                "recipe_name": "长时间切傀儡奇穴改cd"
            }
        },
        6038: {
            1: {
                "recipe_name": "奇穴寄线伤害降低"
            }
        },
        6039: {
            1: {
                "recipe_name": "勾线无目标群攻奇穴增伤"
            }
        },
        6099: {
            1: {
                "recipe_name": "超长勾线减伤害"
            }
        },
        6087: {
            1: {
                "recipe_name": "千里急会心会效提高"
            }
        },
        6040: {
            1: {
                "recipe_name": "夹线奇穴改cd"
            }
        },
        6055: {
            1: {
                "recipe_name": "奇穴傀儡冲刺加一层充能"
            }
        }
    }
}
