RECIPES = {
    1711: {
        1: {
            "recipe_name": "普通攻击提高伤害"
        }
    },
    4892: {
        1: {
            "recipe_name": "心法提高沧月威胁值"
        }
    },
    1110: {
        1: {
            "recipe_name": "日影_疾眩晕1"
        },
        2: {
            "recipe_name": "日影_疾眩晕2"
        }
    },
    3225: {
        1: {
            "recipe_name": "新明光_月终结加伤害_生死"
        }
    },
    3226: {
        1: {
            "recipe_name": "新明光_月终结加伤害_破魔"
        }
    },
    3227: {
        1: {
            "recipe_name": "新明光_月终结加伤害_影子"
        }
    },
    3222: {
        1: {
            "recipe_name": "新明光_日终结加伤害_生死"
        }
    },
    3223: {
        1: {
            "recipe_name": "新明光_日终结加伤害_破魔"
        }
    },
    3224: {
        1: {
            "recipe_name": "新明光_日终结加伤害_影子"
        }
    },
    5930: {
        1: {
            "recipe_name": "净体日斩加伤害"
        }
    },
    5931: {
        1: {
            "recipe_name": "净体月斩加伤害"
        }
    },
    1314: {
        1: {
            "recipe_name": "烈日斩的会心几率提高10%"
        }
    },
    1315: {
        1: {
            "recipe_name": "银月斩的会心几率提高10%"
        }
    },
    5149: {
        1: {
            "recipe_name": "日斩伤害提高"
        }
    },
    5150: {
        1: {
            "recipe_name": "月斩伤害提高"
        }
    },
    5507: {
        1: {
            "recipe_name": "净体日斩减CD"
        }
    },
    5508: {
        1: {
            "recipe_name": "净体月斩减CD"
        }
    },
    3221: {
        1: {
            "recipe_name": "生死劫加cd和dot(已置空)"
        }
    },
    5921: {
        1: {
            "recipe_name": "用晦而明_生死劫加CD"
        }
    }
}
