RECIPES = {
    334: {
        1: {
            "recipe_name": "《羽林枪法·穿云》秘诀残页"
        }
    },
    335: {
        1: {
            "recipe_name": "《羽林枪法·穿云》秘诀断篇"
        }
    },
    338: {
        1: {
            "recipe_name": "《羽林枪法·穿云》参悟残页"
        }
    },
    339: {
        1: {
            "recipe_name": "《羽林枪法·穿云》参悟断篇"
        }
    },
    345: {
        1: {
            "recipe_name": "《游龙骑法·断魂刺》参悟残页"
        }
    },
    346: {
        1: {
            "recipe_name": "《游龙骑法·断魂刺》参悟断篇"
        }
    },
    355: {
        1: {
            "recipe_name": "《羽林枪法·龙牙》秘诀绝章"
        }
    },
    356: {
        1: {
            "recipe_name": "《羽林枪法·龙牙》参悟绝章"
        }
    },
    357: {
        1: {
            "recipe_name": "《羽林枪法·龙牙》秘诀残页"
        }
    },
    358: {
        1: {
            "recipe_name": "《羽林枪法·龙牙》秘诀断篇"
        }
    },
    361: {
        1: {
            "recipe_name": "《羽林枪法·龙牙》参悟残页"
        }
    },
    362: {
        1: {
            "recipe_name": "《羽林枪法·龙牙》参悟断篇"
        }
    },
    367: {
        1: {
            "recipe_name": "《奔雷枪术·灭》秘诀残页"
        }
    },
    368: {
        1: {
            "recipe_name": "《奔雷枪术·灭》秘诀断篇"
        }
    },
    369: {
        1: {
            "recipe_name": "《奔雷枪术·灭》参悟残页"
        }
    },
    370: {
        1: {
            "recipe_name": "《奔雷枪术·灭》参悟断篇"
        }
    },
    398: {
        1: {
            "recipe_name": "《奔雷枪术·突》参悟残页"
        }
    },
    399: {
        1: {
            "recipe_name": "《奔雷枪术·突》参悟断篇"
        }
    },
    1557: {
        1: {
            "recipe_name": "《羽林枪法·龙吟》参悟残页"
        }
    },
    1558: {
        1: {
            "recipe_name": "《羽林枪法·龙吟》参悟断篇"
        }
    },
    1559: {
        1: {
            "recipe_name": "《羽林枪法·龙吟》参悟绝章"
        }
    },
    817: {
        1: {
            "recipe_name": "PVE6件套_花间"
        },
        2: {
            "recipe_name": "PVE6件套_傲血"
        }
    },
    1508: {
        1: {
            "recipe_name": "90级傲血橙武属性1"
        }
    },
    1509: {
        1: {
            "recipe_name": "90级傲血橙武属性2"
        }
    },
    1133: {
        1: {
            "recipe_name": "小橙武_傲血"
        }
    },
    143: {
        1: {
            "recipe_name": "《猿公剑法·剑气长江》秘诀残页"
        }
    },
    144: {
        1: {
            "recipe_name": "《猿公剑法·剑气长江》秘诀断篇"
        }
    },
    145: {
        1: {
            "recipe_name": "《猿公剑法·剑气长江》参悟残页"
        }
    },
    146: {
        1: {
            "recipe_name": "《猿公剑法·剑气长江》参悟断篇"
        }
    },
    155: {
        1: {
            "recipe_name": "《西河剑器·江海凝光》秘诀残页"
        }
    },
    156: {
        1: {
            "recipe_name": "《西河剑器·江海凝光》秘诀断篇"
        }
    },
    160: {
        1: {
            "recipe_name": "《西河剑器·江海凝光》参悟残页"
        }
    },
    161: {
        1: {
            "recipe_name": "《西河剑器·江海凝光》参悟断篇"
        }
    },
    1637: {
        1: {
            "recipe_name": "《西河剑器·玳弦急曲》参悟残页"
        }
    },
    1638: {
        1: {
            "recipe_name": "《西河剑器·玳弦急曲》参悟断篇"
        }
    },
    1639: {
        1: {
            "recipe_name": "《西河剑器·玳弦急曲》参悟绝章"
        }
    },
    1547: {
        1: {
            "recipe_name": "七秀PVE套装属性剑破"
        }
    },
    1524: {
        1: {
            "recipe_name": "90级冰心橙武属性1"
        }
    },
    1525: {
        1: {
            "recipe_name": "90级冰心橙武属性2"
        }
    },
    746: {
        1: {
            "recipe_name": "《引魂蛊术·灵蛊》参悟残页"
        }
    },
    747: {
        1: {
            "recipe_name": "《引魂蛊术·灵蛊》参悟断篇"
        }
    },
    748: {
        1: {
            "recipe_name": "《引魂蛊术·灵蛊》参悟绝章"
        }
    },
    762: {
        1: {
            "recipe_name": "《千劫万毒手·蛇影》秘诀残页"
        }
    },
    763: {
        1: {
            "recipe_name": "《千劫万毒手·蛇影》秘诀断篇"
        }
    },
    764: {
        1: {
            "recipe_name": "《千劫万毒手·蛇影》秘诀绝章"
        }
    },
    767: {
        1: {
            "recipe_name": "《千劫万毒手·蛇影》参悟残页"
        }
    },
    768: {
        1: {
            "recipe_name": "《千劫万毒手·蛇影》参悟断篇"
        }
    },
    773: {
        1: {
            "recipe_name": "《千劫万毒手·百足》参悟绝章"
        }
    },
    774: {
        1: {
            "recipe_name": "《千劫万毒手·百足》参悟残页"
        }
    },
    775: {
        1: {
            "recipe_name": "《千劫万毒手·百足》参悟断篇"
        }
    },
    794: {
        1: {
            "recipe_name": "《千劫万毒手·蝎心》秘诀残页"
        }
    },
    795: {
        1: {
            "recipe_name": "《千劫万毒手·蝎心》秘诀断篇"
        }
    },
    796: {
        1: {
            "recipe_name": "《千劫万毒手·蝎心》参悟残页"
        }
    },
    797: {
        1: {
            "recipe_name": "《千劫万毒手·蝎心》参悟断篇"
        }
    },
    818: {
        1: {
            "recipe_name": "PVE6件套_剑纯"
        },
        2: {
            "recipe_name": "PVE6件套_气纯"
        },
        3: {
            "recipe_name": "PVE6件套_冰心"
        },
        5: {
            "recipe_name": "PVE6件套_易经"
        },
        6: {
            "recipe_name": "PVE6件套_藏剑"
        },
        7: {
            "recipe_name": "PVE6件套_毒经"
        }
    },
    4678: {
        1: {
            "recipe_name": "PVE毒经加蛇影伤害"
        }
    },
    1528: {
        1: {
            "recipe_name": "90级毒经橙武属性1"
        }
    },
    1529: {
        1: {
            "recipe_name": "90级毒经橙武属性2"
        }
    },
    1143: {
        1: {
            "recipe_name": "小橙武_毒经"
        }
    },
    984: {
        1: {
            "recipe_name": "《日月净世·幽月轮》参悟残页"
        }
    },
    985: {
        1: {
            "recipe_name": "《日月净世·幽月轮》参悟断篇"
        }
    },
    988: {
        1: {
            "recipe_name": "《日月净世·幽月轮》秘诀残页"
        }
    },
    989: {
        1: {
            "recipe_name": "《日月净世·幽月轮》秘诀断篇"
        }
    },
    990: {
        1: {
            "recipe_name": "《日月净世·幽月轮》秘诀绝章"
        }
    },
    992: {
        1: {
            "recipe_name": "《日月净世·银月斩》秘诀残页"
        }
    },
    993: {
        1: {
            "recipe_name": "《日月净世·银月斩》秘诀断篇"
        }
    },
    994: {
        1: {
            "recipe_name": "《日月净世·银月斩》秘诀绝章"
        }
    },
    999: {
        1: {
            "recipe_name": "《日月净世·赤日轮》参悟残页"
        }
    },
    1000: {
        1: {
            "recipe_name": "《日月净世·赤日轮》参悟断篇"
        }
    },
    1001: {
        1: {
            "recipe_name": "《日月净世·赤日轮》参悟绝章"
        }
    },
    1004: {
        1: {
            "recipe_name": "《日月净世·赤日轮》秘诀残页"
        }
    },
    1005: {
        1: {
            "recipe_name": "《日月净世·赤日轮》秘诀断篇"
        }
    },
    1007: {
        1: {
            "recipe_name": "《日月净世·烈日斩》参悟残页"
        }
    },
    1008: {
        1: {
            "recipe_name": "《日月净世·烈日斩》参悟断篇"
        }
    },
    1009: {
        1: {
            "recipe_name": "《日月净世·烈日斩》参悟绝章"
        }
    },
    1010: {
        1: {
            "recipe_name": "《日月净世·烈日斩》秘诀残页"
        }
    },
    1011: {
        1: {
            "recipe_name": "《日月净世·烈日斩》秘诀断篇"
        }
    },
    1013: {
        1: {
            "recipe_name": "《日月净世·烈日斩》人偶图断篇"
        }
    },
    1014: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》参悟残页"
        }
    },
    1015: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》参悟断篇"
        }
    },
    1016: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》参悟绝章"
        }
    },
    1017: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》秘诀残页"
        }
    },
    1018: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》秘诀断篇"
        }
    },
    1019: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》秘诀绝章"
        }
    },
    1051: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》参悟残页"
        }
    },
    1052: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》参悟断篇"
        }
    },
    1053: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》参悟绝章"
        }
    },
    1054: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀残页"
        }
    },
    1055: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀断篇"
        }
    },
    1056: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀绝章"
        }
    },
    1621: {
        1: {
            "recipe_name": "《日月净世·生死劫》参悟残页"
        }
    },
    1622: {
        1: {
            "recipe_name": "《日月净世·生死劫》参悟断篇"
        }
    },
    1623: {
        1: {
            "recipe_name": "《日月净世·生死劫》参悟绝章"
        }
    },
    948: {
        1: {
            "recipe_name": "PVP6件套_唐门"
        },
        2: {
            "recipe_name": "PVE6件套_焚影"
        },
        3: {
            "recipe_name": "PVP6件套_明教"
        },
        4: {
            "recipe_name": "PVE6件套_丐帮"
        }
    },
    1542: {
        1: {
            "recipe_name": "90级焚影橙武属性1"
        }
    },
    1543: {
        1: {
            "recipe_name": "90级焚影橙武属性2"
        }
    },
    1148: {
        1: {
            "recipe_name": "小橙武_焚影_月"
        }
    },
    1149: {
        1: {
            "recipe_name": "小橙武_焚影_日"
        }
    },
    1830: {
        1: {
            "recipe_name": "《苍雪刀·劫刀》参悟残页"
        }
    },
    1831: {
        1: {
            "recipe_name": "《苍雪刀·劫刀》参悟断篇"
        }
    },
    1832: {
        1: {
            "recipe_name": "《苍雪刀·劫刀》参悟绝章"
        }
    },
    1833: {
        1: {
            "recipe_name": "《苍雪刀·劫刀》秘诀残页"
        }
    },
    1834: {
        1: {
            "recipe_name": "《苍雪刀·劫刀》秘诀断篇"
        }
    },
    1835: {
        1: {
            "recipe_name": "《苍雪刀·劫刀》秘诀绝章"
        }
    },
    1838: {
        1: {
            "recipe_name": "《苍雪刀·斩刀》参悟残页"
        }
    },
    1839: {
        1: {
            "recipe_name": "《苍雪刀·斩刀》参悟断篇"
        }
    },
    1840: {
        1: {
            "recipe_name": "《苍雪刀·斩刀》参悟绝章"
        }
    },
    1841: {
        1: {
            "recipe_name": "《苍雪刀·斩刀》秘诀残页"
        }
    },
    1842: {
        1: {
            "recipe_name": "《苍雪刀·斩刀》秘诀断篇"
        }
    },
    1843: {
        1: {
            "recipe_name": "《苍雪刀·斩刀》秘诀绝章"
        }
    },
    1846: {
        1: {
            "recipe_name": "《苍雪刀·绝刀》参悟残页"
        }
    },
    1847: {
        1: {
            "recipe_name": "《苍雪刀·绝刀》参悟断篇"
        }
    },
    1848: {
        1: {
            "recipe_name": "《苍雪刀·绝刀》秘诀残页"
        }
    },
    1849: {
        1: {
            "recipe_name": "《苍雪刀·绝刀》秘诀断篇"
        }
    },
    1852: {
        1: {
            "recipe_name": "《云城盾·盾压》参悟残页"
        }
    },
    1853: {
        1: {
            "recipe_name": "《云城盾·盾压》参悟断篇"
        }
    },
    1854: {
        1: {
            "recipe_name": "《云城盾·盾压》秘诀残页"
        }
    },
    1855: {
        1: {
            "recipe_name": "《云城盾·盾压》秘诀断篇"
        }
    },
    1860: {
        1: {
            "recipe_name": "《云城盾·盾刀》参悟残页"
        }
    },
    1861: {
        1: {
            "recipe_name": "《云城盾·盾刀》参悟断篇"
        }
    },
    1862: {
        1: {
            "recipe_name": "《云城盾·盾刀》参悟绝章"
        }
    },
    1863: {
        1: {
            "recipe_name": "《云城盾·盾刀》秘诀残页"
        }
    },
    1864: {
        1: {
            "recipe_name": "《云城盾·盾刀》秘诀断篇"
        }
    },
    1865: {
        1: {
            "recipe_name": "《云城盾·盾刀》秘诀绝章"
        }
    },
    1902: {
        1: {
            "recipe_name": "《破阵令·盾舞》参悟残页"
        }
    },
    1903: {
        1: {
            "recipe_name": "《破阵令·盾舞》参悟断篇"
        }
    },
    1904: {
        1: {
            "recipe_name": "《破阵令·盾舞》秘诀残页"
        }
    },
    1905: {
        1: {
            "recipe_name": "《破阵令·盾舞》秘诀断篇"
        }
    },
    1953: {
        1: {
            "recipe_name": "《破阵令·盾飞》参悟残页"
        }
    },
    1954: {
        1: {
            "recipe_name": "《破阵令·盾飞》参悟断篇"
        }
    },
    1955: {
        1: {
            "recipe_name": "《破阵令·盾飞》秘诀残页"
        }
    },
    1956: {
        1: {
            "recipe_name": "《破阵令·盾飞》秘诀断篇"
        }
    },
    1932: {
        1: {
            "recipe_name": "PVE4件套_分山绝刀"
        }
    },
    1933: {
        1: {
            "recipe_name": "PVE4件套_分山盾压"
        }
    },
    1934: {
        1: {
            "recipe_name": "小橙武_分山劲"
        }
    },
    1936: {
        1: {
            "recipe_name": "小橙武_分山劲2"
        }
    },
    1937: {
        1: {
            "recipe_name": "90橙武分山劲属性1"
        }
    },
    1938: {
        1: {
            "recipe_name": "90橙武分山劲属性2"
        }
    },
    1941: {
        1: {
            "recipe_name": "绝刀无消耗秘籍"
        }
    },
    4124: {
        1: {
            "recipe_name": "《殷雷腿·雷走风切》秘诀残页"
        }
    },
    4125: {
        1: {
            "recipe_name": "《殷雷腿·雷走风切》秘诀断篇"
        }
    },
    4126: {
        1: {
            "recipe_name": "《殷雷腿·雷走风切》秘诀绝章"
        }
    },
    4127: {
        1: {
            "recipe_name": "《殷雷腿·雷走风切》参悟残页"
        }
    },
    4128: {
        1: {
            "recipe_name": "《殷雷腿·雷走风切》参悟断篇"
        }
    },
    4129: {
        1: {
            "recipe_name": "《殷雷腿·雷走风切》参悟绝章"
        }
    },
    4140: {
        1: {
            "recipe_name": "《秀明尘身·项王击鼎》秘诀残页"
        }
    },
    4141: {
        1: {
            "recipe_name": "《秀明尘身·项王击鼎》秘诀断篇"
        }
    },
    4142: {
        1: {
            "recipe_name": "《秀明尘身·项王击鼎》秘诀绝章"
        }
    },
    4143: {
        1: {
            "recipe_name": "《秀明尘身·项王击鼎》参悟残页"
        }
    },
    4144: {
        1: {
            "recipe_name": "《秀明尘身·项王击鼎》参悟断篇"
        }
    },
    4145: {
        1: {
            "recipe_name": "《秀明尘身·项王击鼎》参悟绝章"
        }
    },
    4148: {
        1: {
            "recipe_name": "《秀明尘身·破釜沉舟》秘诀残页"
        }
    },
    4149: {
        1: {
            "recipe_name": "《秀明尘身·破釜沉舟》秘诀断篇"
        }
    },
    4150: {
        1: {
            "recipe_name": "《秀明尘身·破釜沉舟》秘诀绝章"
        }
    },
    4151: {
        1: {
            "recipe_name": "《秀明尘身·破釜沉舟》参悟残页"
        }
    },
    4152: {
        1: {
            "recipe_name": "《秀明尘身·破釜沉舟》参悟断篇"
        }
    },
    4153: {
        1: {
            "recipe_name": "《秀明尘身·破釜沉舟》参悟绝章"
        }
    },
    4156: {
        1: {
            "recipe_name": "《松烟竹雾·碎江天》秘诀残页"
        }
    },
    4157: {
        1: {
            "recipe_name": "《松烟竹雾·碎江天》秘诀断篇"
        }
    },
    4158: {
        1: {
            "recipe_name": "《松烟竹雾·碎江天》秘诀绝章"
        }
    },
    4159: {
        1: {
            "recipe_name": "《松烟竹雾·碎江天》参悟残页"
        }
    },
    4160: {
        1: {
            "recipe_name": "《松烟竹雾·碎江天》参悟断篇"
        }
    },
    4161: {
        1: {
            "recipe_name": "《松烟竹雾·碎江天》参悟绝章"
        }
    },
    4164: {
        1: {
            "recipe_name": "《雪絮金屏·刀啸风吟》秘诀残页"
        }
    },
    4165: {
        1: {
            "recipe_name": "《雪絮金屏·刀啸风吟》秘诀断篇"
        }
    },
    4166: {
        1: {
            "recipe_name": "《雪絮金屏·刀啸风吟》秘诀绝章"
        }
    },
    4167: {
        1: {
            "recipe_name": "《雪絮金屏·刀啸风吟》参悟断篇"
        }
    },
    4168: {
        1: {
            "recipe_name": "《雪絮金屏·刀啸风吟》参悟绝章"
        }
    },
    4172: {
        1: {
            "recipe_name": "《雪絮金屏·醉斩白蛇》秘诀残页"
        }
    },
    4173: {
        1: {
            "recipe_name": "《雪絮金屏·醉斩白蛇》秘诀断篇"
        }
    },
    4174: {
        1: {
            "recipe_name": "《雪絮金屏·醉斩白蛇》秘诀绝章"
        }
    },
    4175: {
        1: {
            "recipe_name": "《雪絮金屏·醉斩白蛇》参悟残页"
        }
    },
    4176: {
        1: {
            "recipe_name": "《雪絮金屏·醉斩白蛇》参悟断篇"
        }
    },
    4177: {
        1: {
            "recipe_name": "《雪絮金屏·醉斩白蛇》参悟绝章"
        }
    },
    4180: {
        1: {
            "recipe_name": "《松烟竹雾·擒龙六斩》秘诀残页"
        }
    },
    4181: {
        1: {
            "recipe_name": "《松烟竹雾·擒龙六斩》秘诀断篇"
        }
    },
    4182: {
        1: {
            "recipe_name": "《松烟竹雾·擒龙六斩》秘诀绝章"
        }
    },
    4183: {
        1: {
            "recipe_name": "《松烟竹雾·擒龙六斩》参悟残页"
        }
    },
    4184: {
        1: {
            "recipe_name": "《松烟竹雾·擒龙六斩》参悟断篇"
        }
    },
    4185: {
        1: {
            "recipe_name": "《松烟竹雾·擒龙六斩》参悟绝章"
        }
    },
    4371: {
        1: {
            "recipe_name": "《秀明尘身·上将军印》秘诀残页"
        }
    },
    4372: {
        1: {
            "recipe_name": "《秀明尘身·上将军印》秘诀断篇"
        }
    },
    4373: {
        1: {
            "recipe_name": "《秀明尘身·上将军印》秘诀绝章"
        }
    },
    4374: {
        1: {
            "recipe_name": "《秀明尘身·上将军印》参悟残页"
        }
    },
    4375: {
        1: {
            "recipe_name": "《秀明尘身·上将军印》参悟断篇"
        }
    },
    4376: {
        1: {
            "recipe_name": "《秀明尘身·上将军印》参悟绝章"
        }
    },
    4290: {
        1: {
            "recipe_name": "PVE6件套_霸刀_醉斩白蛇"
        }
    },
    4291: {
        1: {
            "recipe_name": "PVE6件套_霸刀_破釜沉舟"
        }
    },
    4294: {
        1: {
            "recipe_name": "90橙武霸刀属性1"
        }
    },
    4295: {
        1: {
            "recipe_name": "90橙武霸刀属性2"
        }
    },
    4892: {
        1: {
            "recipe_name": "心法提高沧月威胁值"
        }
    },
    1110: {
        1: {
            "recipe_name": "日影_疾眩晕1"
        },
        2: {
            "recipe_name": "日影_疾眩晕2"
        }
    },
    1711: {
        1: {
            "recipe_name": "普通攻击提高伤害"
        }
    },
    680: {
        1: {
            "recipe_name": "磷光_满堂势效果1"
        },
        2: {
            "recipe_name": "磷光_满堂势效果2"
        }
    },
    681: {
        1: {
            "recipe_name": "入丛_龙池乐效果1"
        },
        2: {
            "recipe_name": "入丛_龙池乐效果2"
        }
    },
    688: {
        1: {
            "recipe_name": "宠物加攻加血1"
        },
        2: {
            "recipe_name": "宠物加攻加血2"
        },
        3: {
            "recipe_name": "宠物加攻加血3"
        }
    },
    2004: {
        1: {
            "recipe_name": "绝返绝刀伤害提高10%"
        }
    },
    2006: {
        1: {
            "recipe_name": "绝返绝刀伤害提高20%"
        }
    },
    2007: {
        1: {
            "recipe_name": "绝返绝刀伤害提高30%"
        }
    },
    2008: {
        1: {
            "recipe_name": "绝返绝刀伤害提高40%"
        }
    },
    4918: {
        1: {
            "recipe_name": "绝刀伤害提高18%"
        }
    },
    4919: {
        1: {
            "recipe_name": "绝刀伤害提高36%"
        }
    },
    4920: {
        1: {
            "recipe_name": "绝刀伤害提高54%"
        }
    },
    4921: {
        1: {
            "recipe_name": "绝刀伤害提高72%"
        }
    },
    5725: {
        1: {
            "recipe_name": "怒气上限额外加成"
        }
    },
    6052: {
        1: {
            "recipe_name": "奇穴傀儡冲刺后千里急增伤"
        }
    },
    6053: {
        1: {
            "recipe_name": "奇穴傀儡冲刺后生地狱增伤"
        }
    },
    6054: {
        1: {
            "recipe_name": "奇穴傀儡冲刺后四边静增伤"
        }
    },
    6066: {
        1: {
            "recipe_name": "非奇穴傀儡冲刺后千里急增伤"
        }
    },
    6067: {
        1: {
            "recipe_name": "非奇穴傀儡冲刺后生地狱增伤"
        }
    },
    6068: {
        1: {
            "recipe_name": "非奇穴傀儡冲刺后四边静增伤"
        }
    }
}
