RECIPES = {
    984: {
        1: {
            "recipe_name": "《日月净世·幽月轮》参悟残页"
        }
    },
    985: {
        1: {
            "recipe_name": "《日月净世·幽月轮》参悟断篇"
        }
    },
    988: {
        1: {
            "recipe_name": "《日月净世·幽月轮》秘诀残页"
        }
    },
    989: {
        1: {
            "recipe_name": "《日月净世·幽月轮》秘诀断篇"
        }
    },
    990: {
        1: {
            "recipe_name": "《日月净世·幽月轮》秘诀绝章"
        }
    },
    992: {
        1: {
            "recipe_name": "《日月净世·银月斩》秘诀残页"
        }
    },
    993: {
        1: {
            "recipe_name": "《日月净世·银月斩》秘诀断篇"
        }
    },
    994: {
        1: {
            "recipe_name": "《日月净世·银月斩》秘诀绝章"
        }
    },
    999: {
        1: {
            "recipe_name": "《日月净世·赤日轮》参悟残页"
        }
    },
    1000: {
        1: {
            "recipe_name": "《日月净世·赤日轮》参悟断篇"
        }
    },
    1001: {
        1: {
            "recipe_name": "《日月净世·赤日轮》参悟绝章"
        }
    },
    1004: {
        1: {
            "recipe_name": "《日月净世·赤日轮》秘诀残页"
        }
    },
    1005: {
        1: {
            "recipe_name": "《日月净世·赤日轮》秘诀断篇"
        }
    },
    1007: {
        1: {
            "recipe_name": "《日月净世·烈日斩》参悟残页"
        }
    },
    1008: {
        1: {
            "recipe_name": "《日月净世·烈日斩》参悟断篇"
        }
    },
    1009: {
        1: {
            "recipe_name": "《日月净世·烈日斩》参悟绝章"
        }
    },
    1010: {
        1: {
            "recipe_name": "《日月净世·烈日斩》秘诀残页"
        }
    },
    1011: {
        1: {
            "recipe_name": "《日月净世·烈日斩》秘诀断篇"
        }
    },
    1013: {
        1: {
            "recipe_name": "《日月净世·烈日斩》人偶图断篇"
        }
    },
    1014: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》参悟残页"
        }
    },
    1015: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》参悟断篇"
        }
    },
    1016: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》参悟绝章"
        }
    },
    1017: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》秘诀残页"
        }
    },
    1018: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》秘诀断篇"
        }
    },
    1019: {
        1: {
            "recipe_name": "《日月净世·净世破魔击》秘诀绝章"
        }
    },
    1051: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》参悟残页"
        }
    },
    1052: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》参悟断篇"
        }
    },
    1053: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》参悟绝章"
        }
    },
    1054: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀残页"
        }
    },
    1055: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀断篇"
        }
    },
    1056: {
        1: {
            "recipe_name": "《御暗烬灭令·驱夜断愁》秘诀绝章"
        }
    },
    1621: {
        1: {
            "recipe_name": "《日月净世·生死劫》参悟残页"
        }
    },
    1622: {
        1: {
            "recipe_name": "《日月净世·生死劫》参悟断篇"
        }
    },
    1623: {
        1: {
            "recipe_name": "《日月净世·生死劫》参悟绝章"
        }
    },
    948: {
        1: {
            "recipe_name": "PVP6件套_唐门"
        },
        2: {
            "recipe_name": "PVE6件套_焚影"
        },
        3: {
            "recipe_name": "PVP6件套_明教"
        },
        4: {
            "recipe_name": "PVE6件套_丐帮"
        }
    },
    1542: {
        1: {
            "recipe_name": "90级焚影橙武属性1"
        }
    },
    1543: {
        1: {
            "recipe_name": "90级焚影橙武属性2"
        }
    },
    1148: {
        1: {
            "recipe_name": "小橙武_焚影_月"
        }
    },
    1149: {
        1: {
            "recipe_name": "小橙武_焚影_日"
        }
    },
    4892: {
        1: {
            "recipe_name": "心法提高沧月威胁值"
        }
    },
    1110: {
        1: {
            "recipe_name": "日影_疾眩晕1"
        },
        2: {
            "recipe_name": "日影_疾眩晕2"
        }
    },
    1711: {
        1: {
            "recipe_name": "普通攻击提高伤害"
        }
    }
}
