SKILLS: dict[int, dict[int, dict]] = {
    10390: {
        13039: dict(channel_interval=24)
    },
    13044: {
        13044: dict(comment="1段"),
        13244: dict(comment="2段"),
        13060: dict(comment="3段")
    },
    13046: {
        13099: {}
    },
    13047: {
        13106: dict(comment="1段"),
        13160: dict(comment="2段"),
        13161: dict(comment="3段")
    },
    13045: {
        19409: {}
    },
    13052: {
        28479: {}
    },
    13054: {
        13092: {},
        32745: dict(levels=[1])
    },
    13055: {
        13075: {},
        32745: dict(levels=[3])
    },
    13053: {
        13453: {}
    },
    13050: {
        13463: {}
    },
    13048: {
        38973: {},
        38971: dict(levels=[1])
    },
    13424: {
        13206: {}
    },
    40721: {
        40721: {}
    }
}
