BUFFS: dict[int, dict] = {
    31624: dict(
        name="落笼簿",
        comments={
            1: "原始",
            2: "联套"
        }),
    31755: dict(comments={
        1: "原始",
        2: "双音"
    }),
    31520: dict(name="缠绞", skills=[41471, 41472, 41473, 42021, 42084, 42033, 42247, 42384]),
    31673: dict(name="虚影", skills=[41471, 41472, 41473, 42021, 42084, 41465, 42265, 41486, 41994, 42098, 42381]),
    31882: dict(name="联套", skills=[41471, 41472, 41473, 42021, 42084, 42033, 42247, 42384]),
    31870: dict(attributes=[("coming_damage_cof", 157)], skills=[41471, 41472, 41473, 42384]),
    31765: dict(name="寡合"),
    31780: dict(name="谐调"),
    31889: dict(name="镜同")
}
